$(function() {
  var hasIndex, index;
  hasIndex = window.location.href.split("?").length > 1;
  index = hasIndex ? window.location.href.split("?")[1].split("=")[1] : 0;


  var data = [
    //第一本书
    {
      //书的信息
      BookInformation: {
        bookName: "黄山风景区",
        author: "4.7",
        press: "5A",
        year: "山水景点",
        price: "黄山市黄山区汤口镇汤泉路1号",
        Binding: "2023年4月份每周三免票开放日",
        // folio: "16",
        ISBN: "0559-2590999",
        imgUrl: "./images/20.jpg",
        authorIntro: " 停车场【黄山风景区南/北大门停车场】参考价格：¥50/次 园内交通：地址：黄山风景区慈光阁；下起温泉景区观瀑楼、上至玉屏景区蒲团松；地址：西海景区排云亭右侧的松林峰；下站设在松谷景区的松谷庵；地址：西海大峡谷南侧的的山谷内；下起排云溪，上至天海；参考价格：80元/人；地址：黄山风景区云谷寺；下至云谷景区观云谷寺、上至北海景区白鹅岭，云谷索道可从黄山南大门进入后至云谷站乘坐卫生间：设有多个卫生间:均有指示牌。吸烟区：地理位置：黄山风景区内设有多个吸烟区，可根据景区导览进行选择。残障通道：景区游客服务中心。餐饮：黄山风景区内设有多个餐厅，具体位置可询问工作人员或根据导览标示选择。纪念品商店：黄山风景区设有纪念品商店，具体位置可询问工作人员或根据导览标示选择。",
        //图书标签
        bookLabel: ['山', '水',],
        //主题词
        themaWords: ['慈光阁', '云谷寺'],
        //内容提要
        contentSummary: '黄山风景区坐落于黄山市黄山区汤口镇境内。黄山自古以来就是中国数一数二的名山，奇松、怪石、云海、温泉被称为黄山的“四绝”。除此之外，雾凇、雪景、日出也是游人不会错过的景观，古人有“五岳归来不看山，黄山归来不看岳”的说法。景区内分为南门、西门和北门，绝大多数游客都会从南门出入，南门又有前山后山两个出入口，都靠近山脚下的汤口镇。镇上也成了游玩黄山的中转站，很多游客都会提前赶到这里住宿一晚。汤口镇上到景区门口需乘黄山新国线班车，在前山山门（慈光阁）、后山山门（云谷寺）、黄山温泉都会停靠。景区游览主要分为前山、后山两条上山路线，都通向主峰之一光明顶，在光明顶的另一侧，还有一条环线-西海大峡谷。',
        //本书目录
        catalogues: ['一、节假日营业时间同周六周日。 二、交通股份公司换乘车辆经营时间 1、3月2日-10月31日： 周一至周五06:40-16:40（上行），07:10-17:40（下行）； 周六、周日及小长假06:10-17:10（上行），06:40-18:10（下行）。 2、11月1日-3月1日（含周六、周日及小长假）：07:40-16:10（上行）；08:10-17:10（下行）。 三、云谷索道、玉屏索道、太平索道经营时间 1、3月2日-10月31日： 周一至周五07:00-17:10； 周六、周日及小长假06:30-17:40； 2、11月1日-3月1日（含周六、周日及小长假）：08:00-16:40。'],
      },
      //同类书籍
      similarBook: [
        {
          bookName: "北京环球度假区",
          author: "4.5",
          press: "无",
          year: "亲子乐园",
          ISBN: "4000 688 688",
          imgUrl: "./images/21.jpg",
        },
        {
          bookName: "三亚亚特兰蒂斯度假区",
          author: "4.6",
          press: "无",
          year: "水下乐园",
          ISBN: "0898-88986666",
          imgUrl: "./img/22.jpg"
        },
        {
          bookName: "普陀山风景区",
          author: "4.7",
          press: "5A",
          year: "山水景点",
          ISBN: "0580-3191919,0580-3889090",
          imgUrl: "./img/23.jpg"
        },
        {
          bookName: "蜈支洲岛",
          author: "4.6",
          press: "5A",
          year: "玩水避暑",
          ISBN: "0898-88751258",
          imgUrl: "./img/24.jpg"
        },
        {
          bookName: "灵隐寺",
          author: "4.7",
          press: "无",
          year: "观光游玩",
          ISBN: "0571-87968665",
          imgUrl: "./img/25.jpg"
        },

      ],
      //购买推荐
      PurchaseRe: [{
        libraryName: "西湖",
        address: "杭州市西湖风景名胜区"
      },
      {
        libraryName: "杭州宋城",
        address: "杭州市西湖区之江路148号"
      },
      {
        libraryName: "千岛湖景区",
        address: "杭州市淳安县千岛湖镇梦姑路348号千岛湖中心湖区游船码头"
      },
      {
        libraryName: "上海迪士尼度假区",
        address: "上海市浦东新区川沙新镇黄赵路310号"
      },
      {
        libraryName: "东方明珠",
        address: "上海市浦东新区陆家嘴世纪大道1号"
      },
      {
        libraryName: "成都大熊猫繁育研究基地",
        address: "成都市成华区外北熊猫大道1375号"
      }
      ],
      //借阅推荐
      borrowRe: [{
        libraryName: "钟鼓索道",
        address: "福建省厦门市思明区虎园路31号"
      },
      {
        libraryName: "鼓浪屿",
        address: "厦门市思明区鼓浪屿"
      }
      ],
      comment: [{
        userName: "无昵称用户",
        time: "2017-12-10 08:08:45",
        good: 3,
        bad: 3,
        con: "登黄山天下无山 疫情后第一次出行就给了黄山，距离上一次登黄山已经18年了，这次看到了日落，第二天错过了日出，但是回头看到一轮圆月挂在晴空，原来一切都是最好的安排！"
      },
      {
        userName: "叫.。。",
        time: "2017-11-14 14:27:05",
        good: 94,
        bad: 17,
        con: "赶上好天气，看到了一年中难得一见的云海。“不做天上仙，愿为黄山客”黄山奇石、怪松、云海、险峰，太美了。俗话说，黄山归来不看岳。我建议后山坐云谷索道上山，玉屏索道下山，这样比较节约体力。"
      },
      {
        userName: "巍峨哇",
        time: "2017-08-24 22:04:08",
        good: 117,
        bad: 49,
        con: "风景很美，缆车非常的平稳，不错不错，省去了很多爬山的辛苦，提高了旅游的舒适度，节省了很多的时间，随手一拍都是美景，非常享受啊"
      },
      {
        userName: "匿名用户",
        time: "2017-11-14 17:24:17",
        good: 8,
        bad: 1,
        con: "五岳归来不看山，黄山归来不看岳。 黄山雪景真绝美！这次黄山之行看到了雾凇、雪景、日出、云海，非常圆满。黄山上的配套设备及服务也非常完善，上厕所出来听到几个南方小伙感慨：太奢侈了，厕所还有热水洗手和暖气！"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-30 15:17:50",
        good: 6,
        bad: 1,
        con: "山之行，绝对超妙，来此一趟，此生无憾。 大美黄山，银装素裹，莲花峰巅，灿若星辰。 携老提幼，兴致勃勃，大好河山，尽收眼底。 迎客之松，大气磅礴，光明之頂，一览无余。 总结：绝美黄山，不虚此行。"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-19 13:07:17",
        good: 0,
        bad: 3,
        con: "在携程上预定，刷身份证就能进入大门，也可以坐缆车，免去排队买票的时间，非常方便，而且黄山每天上山人数有限制，如果人太多，那就没有票可以买了，推荐大家提前在携程上买票"
      }
      ]


    },


    //第二本书   
    {
      //书的信息
      BookInformation: {
        bookName: "北京环球度假区",
        author: "4.5",
        press: "无",
        year: "亲子乐园",
        price: "北京市通州区北京环球度假区",
        Binding: "无",
        // folio: "32",
        ISBN: "4000 688 688",
        imgUrl: "./images/21.jpg",
        authorIntro: "WIFI：账号：Universal；密码：您可由移动终端设备登录认证页面输入手机号并获得验证码，进行注册并连接到WIFI网络；范围：园区内行李寄存：参考价格：收费；地址：主题公园入口，北京环球城市大道，哈利·波特与禁忌之旅、飞越侏罗纪、霸天虎过山车入口处；地址：主题公园入口和北京环球城市大道；尺寸超过长56cm x 宽36cm x 高23cm的背包/容器仅能寄存在行李寄存服务中心，不能带入主题公园。童车租赁：参考价格：收费；地址：主题公园入口轮椅租赁：参考价格：收费；地址：主题公园入口吸烟区：地理位置：景区在多个地点设有指定的区域母婴室",
        //图书标签
        bookLabel: ['旅游', '游玩',],
        //主题词
        themaWords: ['主题公园'],
        //内容提要
        contentSummary: '北京环球度假区是一个广受期待的主题公园旅游目的地，包括开园规模大的环球主题公园，北京环球城市大道，以及两家度假酒店。北京环球度假区糅合中国文化元素精心打造独特体验，拥有七大主题景区，37个骑乘娱乐设施及地标景点，24个表演演出，80个餐饮门店以及30个零售门店。',
        //本书目录
        catalogues: ['景区开放时间动态变化，实际请以出行当天景区官方小程序公示的营业时间为准'],
      },
      //同类书籍
      similarBook: [{
    
         bookName: "台北故宫博物院",
         author: "4.7",
         press: "无",
         year: "亲子乐园",
         ISBN: "886-2-28812021",
         imgUrl: "./img/26.jpg",
       },
       {
         bookName: "西门町",
         author: "4.6",
         press: "无",
         year: "观光乐园",
         ISBN: "886-2-7208889",
         imgUrl: "./img/27.jpg"
       },
       {
         bookName: "故宫博物院",
         author: "4.8",
         press: "5A",
         year: "地标景点",
         ISBN: "4009501925",
         imgUrl: "./img/28.jpg"
       },
       {
         bookName: "拙政园",
         author: "4.6",
         press: "5A",
         year: "赏花踏青",
         ISBN: "0512-962015",
         imgUrl: "./img/29.jpg"
       },
       {
         bookName: "夫子庙",
         author: "4.7",
         press: "无",
         year: "观光游玩",
         ISBN: "025-52209788,025-52855667",
         imgUrl: "./img/30.jpg"
       },
       
      ],
      //购买推荐
     PurchaseRe: [{
       libraryName: "西湖",
       address: "杭州市西湖风景名胜区"
     },
     {
       libraryName: "杭州宋城",
       address: "杭州市西湖区之江路148号"
     },
     {
       libraryName: "千岛湖景区",
       address: "杭州市淳安县千岛湖镇梦姑路348号千岛湖中心湖区游船码头"
     },
     {
       libraryName: "上海迪士尼度假区",
       address: "上海市浦东新区川沙新镇黄赵路310号"
     },
     {
       libraryName: "东方明珠",
       address: "上海市浦东新区陆家嘴世纪大道1号"
     },
     {
       libraryName: "成都大熊猫繁育研究基地",
       address: "成都市成华区外北熊猫大道1375号"
     }
     ],
     //借阅推荐
     borrowRe: [{
       libraryName: "钟鼓索道",
       address: "福建省厦门市思明区虎园路31号"
     },
     {
       libraryName: "鼓浪屿",
       address: "厦门市思明区鼓浪屿"
     }
     ],
     comment: [{
       userName: "无昵称用户",
       time: "2017-12-10 08:08:45",
       good: 3,
       bad: 3,
       con: "登黄山天下无山 疫情后第一次出行就给了黄山，距离上一次登黄山已经18年了，这次看到了日落，第二天错过了日出，但是回头看到一轮圆月挂在晴空，原来一切都是最好的安排！"
     },
     {
       userName: "叫.。。",
       time: "2017-11-14 14:27:05",
       good: 94,
       bad: 17,
       con: "赶上好天气，看到了一年中难得一见的云海。“不做天上仙，愿为黄山客”黄山奇石、怪松、云海、险峰，太美了。俗话说，黄山归来不看岳。我建议后山坐云谷索道上山，玉屏索道下山，这样比较节约体力。"
     },
     {
       userName: "巍峨哇",
       time: "2017-08-24 22:04:08",
       good: 117,
       bad: 49,
       con: "风景很美，缆车非常的平稳，不错不错，省去了很多爬山的辛苦，提高了旅游的舒适度，节省了很多的时间，随手一拍都是美景，非常享受啊"
     },
     {
       userName: "匿名用户",
       time: "2017-11-14 17:24:17",
       good: 8,
       bad: 1,
       con: "五岳归来不看山，黄山归来不看岳。 黄山雪景真绝美！这次黄山之行看到了雾凇、雪景、日出、云海，非常圆满。黄山上的配套设备及服务也非常完善，上厕所出来听到几个南方小伙感慨：太奢侈了，厕所还有热水洗手和暖气！"
     },
     {
       userName: "无昵称用户",
       time: "2017-10-30 15:17:50",
       good: 6,
       bad: 1,
       con: "山之行，绝对超妙，来此一趟，此生无憾。 大美黄山，银装素裹，莲花峰巅，灿若星辰。 携老提幼，兴致勃勃，大好河山，尽收眼底。 迎客之松，大气磅礴，光明之頂，一览无余。 总结：绝美黄山，不虚此行。"
     },
     {
       userName: "无昵称用户",
       time: "2017-10-19 13:07:17",
       good: 0,
       bad: 3,
       con: "在携程上预定，刷身份证就能进入大门，也可以坐缆车，免去排队买票的时间，非常方便，而且黄山每天上山人数有限制，如果人太多，那就没有票可以买了，推荐大家提前在携程上买票"
     }
     ]
     
    },


    //第三本书
    {
      //书的信息
      BookInformation: {
        bookName: "三亚亚特兰蒂斯度假区",
        author: "4.6",
        press: "无",
        year: "水下乐园",
        price: "三亚市海棠湾海棠北路三亚亚特兰蒂斯",
        Binding: "无",
        // folio: "32",
        ISBN: "0898-88986666",
        imgUrl: "./img/22.jpg",
        authorIntro: "停车场：【亚特兰蒂斯酒店停车场】参考价格：大中型车辆临时停放首小时 8元（此后每小时4元），24小时上限40元。 小型车辆临时停放首小时5元（此后每小时3元），24小时上限20元。 ；地址：室外；库位：以景区实际情况为准；首小时30 分钟内免费，住店客人免费、按序排队候客的出租车免费、使用充电桩的车辆免费",
        //图书标签
        bookLabel: ['亚特兰蒂斯',],
        //主题词
        themaWords: ['水下', '鱼'],
        //内容提要
        contentSummary: '三亚亚特兰蒂斯度假区坐落于三亚海棠湾国家海岸，它以消失的亚特兰蒂斯大陆之谜为主题，提供各种各样的娱乐消遣项目，你可以在亚特兰蒂斯水世界享受阳光、水花和无尽欢愉！失落的空间水族馆开启神奇冒险之旅，探索海洋深处的奥秘。而亚特兰蒂斯海豚湾是由国际专业设计团队为海豚，海狮等海洋哺乳动物精心打造的栖息家园。',
        //本书目录
        catalogues: ['无']
      },
      //同类书籍
      similarBook: [{
          bookName: "黄山风景区",
          author: "4.7",
          press: "5A",
          year: "山水景点",
          ISBN: "0559-2590999",
          imgUrl: "./images/20.jpg",
        },
        {
          bookName: "北京环球度假区",
          author: "4.5",
          press: "无",
          year: "亲子乐园",
          ISBN: "亲子乐园",
          imgUrl: "./images/21.jpg"
        },
        {
          bookName: "普陀山风景区",
          author: "4.7",
          press: "5A",
          year: "山水景点",
          ISBN: "0580-3191919,0580-3889090",
          imgUrl: "./img/23.jpg"
        },
        {
          bookName: "蜈支洲岛",
          author: "4.6",
          press: "5A",
          year: "玩水避暑",
          ISBN: "0898-88751258",
          imgUrl: "./img/24.jpg"
        },
        {
          bookName: "灵隐寺",
          author: "4.7",
          press: "无",
          year: "观光游玩",
          ISBN: "0571-87968665",
          imgUrl: "./img/25.jpg"
        },

      ],
      //购买推荐
      PurchaseRe: [{
        libraryName: "西湖",
        address: "杭州市西湖风景名胜区"
      },
      {
        libraryName: "杭州宋城",
        address: "杭州市西湖区之江路148号"
      },
      {
        libraryName: "千岛湖景区",
        address: "杭州市淳安县千岛湖镇梦姑路348号千岛湖中心湖区游船码头"
      },
      {
        libraryName: "上海迪士尼度假区",
        address: "上海市浦东新区川沙新镇黄赵路310号"
      },
      {
        libraryName: "东方明珠",
        address: "上海市浦东新区陆家嘴世纪大道1号"
      },
      {
        libraryName: "成都大熊猫繁育研究基地",
        address: "成都市成华区外北熊猫大道1375号"
      }
      ],
      //借阅推荐
      borrowRe: [{
        libraryName: "钟鼓索道",
        address: "福建省厦门市思明区虎园路31号"
      },
      {
        libraryName: "鼓浪屿",
        address: "厦门市思明区鼓浪屿"
      }
      ],
      comment: [{
        userName: "无昵称用户",
        time: "2017-12-10 08:08:45",
        good: 3,
        bad: 3,
        con: "登黄山天下无山 疫情后第一次出行就给了黄山，距离上一次登黄山已经18年了，这次看到了日落，第二天错过了日出，但是回头看到一轮圆月挂在晴空，原来一切都是最好的安排！"
      },
      {
        userName: "叫.。。",
        time: "2017-11-14 14:27:05",
        good: 94,
        bad: 17,
        con: "赶上好天气，看到了一年中难得一见的云海。“不做天上仙，愿为黄山客”黄山奇石、怪松、云海、险峰，太美了。俗话说，黄山归来不看岳。我建议后山坐云谷索道上山，玉屏索道下山，这样比较节约体力。"
      },
      {
        userName: "巍峨哇",
        time: "2017-08-24 22:04:08",
        good: 117,
        bad: 49,
        con: "风景很美，缆车非常的平稳，不错不错，省去了很多爬山的辛苦，提高了旅游的舒适度，节省了很多的时间，随手一拍都是美景，非常享受啊"
      },
      {
        userName: "匿名用户",
        time: "2017-11-14 17:24:17",
        good: 8,
        bad: 1,
        con: "五岳归来不看山，黄山归来不看岳。 黄山雪景真绝美！这次黄山之行看到了雾凇、雪景、日出、云海，非常圆满。黄山上的配套设备及服务也非常完善，上厕所出来听到几个南方小伙感慨：太奢侈了，厕所还有热水洗手和暖气！"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-30 15:17:50",
        good: 6,
        bad: 1,
        con: "山之行，绝对超妙，来此一趟，此生无憾。 大美黄山，银装素裹，莲花峰巅，灿若星辰。 携老提幼，兴致勃勃，大好河山，尽收眼底。 迎客之松，大气磅礴，光明之頂，一览无余。 总结：绝美黄山，不虚此行。"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-19 13:07:17",
        good: 0,
        bad: 3,
        con: "在携程上预定，刷身份证就能进入大门，也可以坐缆车，免去排队买票的时间，非常方便，而且黄山每天上山人数有限制，如果人太多，那就没有票可以买了，推荐大家提前在携程上买票"
      }
      ]
    },


    //第四本书
    {
      //书的信息
      BookInformation: {
        bookName: "普陀山风景区",
        author: "4.7",
        press: "5A",
        year: " 山水景点",
        price: "山市普陀山梅岑路85-1号普陀山正山门旅游服务中心",
        Binding: "开园中；06:30-21:50开放",
        // folio: "32",
        ISBN: " 0580-3191919,0580-388909",
        imgUrl: "./img/23.jpg",
        authorIntro: "停车场：【慈航广场停车场】参考价格：¥10/小时；地址：慈航广场门口；库位：5000；按淡旺季收费，4元/小时-10元/小时不等园内交通：参考价格：30元/人；地址：沈家门半升洞码头和朱家尖蜈蚣峙码头；所有购买过船票的游客均可乘坐卫生间：售票大厅、后船大厅，岛上都设有多个卫生间，均标有醒目的指示牌。餐饮：普陀山岛上设有多个餐厅，标有醒目的指示牌。纪念品商店：普陀山岛上设有多个纪念品店铺，标有醒目的指示牌。",
        //图书标签
        bookLabel: ['海天佛国',],
        //主题词
        themaWords: ['普济、法雨、慧济'],
        //内容提要
        contentSummary: '普陀山是观音菩萨的道场，有“海天佛国”的美誉。普济、法雨、慧济三大寺，还有33米高的南海观音立像，是游人香客们都不愿错过的景观。宜人的山海风光是普陀山另一动人之处，漫步千步沙，远眺海上卧佛，非常享受。',
        //本书目录
        catalogues: ['具体以当天最后一班班船为准，寺庙以现场实际情况为准'],
      },
      //同类书籍
      similarBook: [  {
         bookName: "故宫博物院",
         author: "4.8",
         press: "5A",
         year: "地标景点",
         ISBN: "4009501925",
         imgUrl: "./img/28.jpg"
       },
       {
         bookName: "拙政园",
         author: "4.6",
         press: "5A",
         year: "赏花踏青",
         ISBN: "0512-962015",
         imgUrl: "./img/29.jpg"
       },
       {
         bookName: "夫子庙",
         author: "4.7",
         press: "无",
         year: "观光游玩",
         ISBN: "025-52209788,025-52855667",
         imgUrl: "./img/30.jpg"
       },
        {
          bookName: "蜈支洲岛",
          author: "4.6",
          press: "5A",
          year: "玩水避暑",
          ISBN: "0898-88751258",
          imgUrl: "./img/24.jpg"
        },
        {
          bookName: "灵隐寺",
          author: "4.7",
          press: "无",
          year: "观光游玩",
          ISBN: "0571-87968665",
          imgUrl: "./img/25.jpg"
        },
      
      ],
      //购买推荐
      PurchaseRe: [{
        libraryName: "西湖",
        address: "杭州市西湖风景名胜区"
      },
      {
        libraryName: "杭州宋城",
        address: "杭州市西湖区之江路148号"
      },
      {
        libraryName: "千岛湖景区",
        address: "杭州市淳安县千岛湖镇梦姑路348号千岛湖中心湖区游船码头"
      },
      {
        libraryName: "上海迪士尼度假区",
        address: "上海市浦东新区川沙新镇黄赵路310号"
      },
      {
        libraryName: "东方明珠",
        address: "上海市浦东新区陆家嘴世纪大道1号"
      },
      {
        libraryName: "成都大熊猫繁育研究基地",
        address: "成都市成华区外北熊猫大道1375号"
      }
      ],
      //借阅推荐
      borrowRe: [{
        libraryName: "钟鼓索道",
        address: "福建省厦门市思明区虎园路31号"
      },
      {
        libraryName: "鼓浪屿",
        address: "厦门市思明区鼓浪屿"
      }
      ],
      comment: [{
        userName: "无昵称用户",
        time: "2017-12-10 08:08:45",
        good: 3,
        bad: 3,
        con: "登黄山天下无山 疫情后第一次出行就给了黄山，距离上一次登黄山已经18年了，这次看到了日落，第二天错过了日出，但是回头看到一轮圆月挂在晴空，原来一切都是最好的安排！"
      },
      {
        userName: "叫.。。",
        time: "2017-11-14 14:27:05",
        good: 94,
        bad: 17,
        con: "赶上好天气，看到了一年中难得一见的云海。“不做天上仙，愿为黄山客”黄山奇石、怪松、云海、险峰，太美了。俗话说，黄山归来不看岳。我建议后山坐云谷索道上山，玉屏索道下山，这样比较节约体力。"
      },
      {
        userName: "巍峨哇",
        time: "2017-08-24 22:04:08",
        good: 117,
        bad: 49,
        con: "风景很美，缆车非常的平稳，不错不错，省去了很多爬山的辛苦，提高了旅游的舒适度，节省了很多的时间，随手一拍都是美景，非常享受啊"
      },
      {
        userName: "匿名用户",
        time: "2017-11-14 17:24:17",
        good: 8,
        bad: 1,
        con: "五岳归来不看山，黄山归来不看岳。 黄山雪景真绝美！这次黄山之行看到了雾凇、雪景、日出、云海，非常圆满。黄山上的配套设备及服务也非常完善，上厕所出来听到几个南方小伙感慨：太奢侈了，厕所还有热水洗手和暖气！"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-30 15:17:50",
        good: 6,
        bad: 1,
        con: "山之行，绝对超妙，来此一趟，此生无憾。 大美黄山，银装素裹，莲花峰巅，灿若星辰。 携老提幼，兴致勃勃，大好河山，尽收眼底。 迎客之松，大气磅礴，光明之頂，一览无余。 总结：绝美黄山，不虚此行。"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-19 13:07:17",
        good: 0,
        bad: 3,
        con: "在携程上预定，刷身份证就能进入大门，也可以坐缆车，免去排队买票的时间，非常方便，而且黄山每天上山人数有限制，如果人太多，那就没有票可以买了，推荐大家提前在携程上买票"
      }
      ]
    },



    //第五本书
    {
      //书的信息
      BookInformation: {
        bookName: "蜈支洲岛",
        author: "4.7",
        press: "5A",
        year: " 玩水避暑",
        price: "三亚市海棠区海棠湾镇蜈支洲岛",
        Binding: "无",
        // folio: "32",
        ISBN: "0898-88751258",
        imgUrl: "./img/24.jpg",
        authorIntro: "停车场：【生态停车场】参考价格：收费；地址：蜈支洲岛景区大门口对侧；库位：1500；小型车8元/次，中型车10元/次，大型车15元/次，车辆停放时间30分钟（含）以内的不收费用，超出30分钟按一次收费，中途不出场的车辆最高24小时算一次。手机充电：游客中心二楼询问台可租借行李寄存：参考价格：免费；地址：游客中心二楼问询台；不含背包、手提袋；参考价格：30元/个；地址：游客中心登船排队入口处、岛上海洋运动俱乐部卫生间：景区内设有卫生间，在景区入口等地设置有明显标志牌母婴室：地址：景区卫生间有母婴室餐饮：蜈支洲岛内设有多个餐厅，具体位置可询问工作人员或根据导览标示选择。自动售卖机：蜈支洲岛内设有多个自动售卖机，可使用支付宝/微信支付。便利店：蜈支洲岛内设有多个便利店，可使用支付宝/微信支付。",
        //图书标签
        bookLabel: ['蜜月度假','海岛观光'],
        //主题词
        themaWords: ['海底生态资源'],
        //内容提要
        contentSummary: '蜈支洲岛旅游区是5A级景区，坐落于三亚市海棠湾内，面积共有1.48平方公里，拥有丰富的海底生态资源和品类齐全、“四栖”全域玩海的水上运动产品体系。现已成为一座集海岛观光、项目游玩、蜜月度假和亲子旅游等元素于一体的国家海岸海岛旅游度假综合体，是全国知名的旅游目的地品牌。',
        //本书目录
        catalogues: ['上岛时间：08:00-16:00；下岛时间：08:30-18:30（营业时间及客船上下岛时间受海况和天气等特殊情况影响可能会临时调整，如遇特殊情况，请提前致电景区咨询，实际时间以当天景区营业通知为准，不便之处敬请谅解）']
      },
      //同类书籍
    similarBook: [{
        bookName: "黄山风景区",
        author: "4.7",
        press: "5A",
        year: "山水景点",
        ISBN: "0559-2590999",
        imgUrl: "./images/20.jpg",
      },
      {
        bookName: "北京环球度假区",
        author: "4.5",
        press: "无",
        year: "亲子乐园",
        ISBN: "亲子乐园",
        imgUrl: "./images/21.jpg"
      },
      {
        bookName: "普陀山风景区",
        author: "4.7",
        press: "5A",
        year: "山水景点",
        ISBN: "0580-3191919,0580-3889090",
        imgUrl: "./img/23.jpg"
      },
   {
     bookName: "夫子庙",
     author: "4.7",
     press: "无",
     year: "观光游玩",
     ISBN: "025-52209788,025-52855667",
     imgUrl: "./img/30.jpg"
   },
      {
        bookName: "灵隐寺",
        author: "4.7",
        press: "无",
        year: "观光游玩",
        ISBN: "0571-87968665",
        imgUrl: "./img/25.jpg"
      },
    
    ],
    //购买推荐
    PurchaseRe: [{
      libraryName: "西湖",
      address: "杭州市西湖风景名胜区"
    },
    {
      libraryName: "杭州宋城",
      address: "杭州市西湖区之江路148号"
    },
    {
      libraryName: "千岛湖景区",
      address: "杭州市淳安县千岛湖镇梦姑路348号千岛湖中心湖区游船码头"
    },
    {
      libraryName: "上海迪士尼度假区",
      address: "上海市浦东新区川沙新镇黄赵路310号"
    },
    {
      libraryName: "东方明珠",
      address: "上海市浦东新区陆家嘴世纪大道1号"
    },
    {
      libraryName: "成都大熊猫繁育研究基地",
      address: "成都市成华区外北熊猫大道1375号"
    }
    ],
    //借阅推荐
    borrowRe: [{
      libraryName: "钟鼓索道",
      address: "福建省厦门市思明区虎园路31号"
    },
    {
      libraryName: "鼓浪屿",
      address: "厦门市思明区鼓浪屿"
    }
    ],
    comment: [{
      userName: "无昵称用户",
      time: "2017-12-10 08:08:45",
      good: 3,
      bad: 3,
      con: "登黄山天下无山 疫情后第一次出行就给了黄山，距离上一次登黄山已经18年了，这次看到了日落，第二天错过了日出，但是回头看到一轮圆月挂在晴空，原来一切都是最好的安排！"
    },
    {
      userName: "叫.。。",
      time: "2017-11-14 14:27:05",
      good: 94,
      bad: 17,
      con: "赶上好天气，看到了一年中难得一见的云海。“不做天上仙，愿为黄山客”黄山奇石、怪松、云海、险峰，太美了。俗话说，黄山归来不看岳。我建议后山坐云谷索道上山，玉屏索道下山，这样比较节约体力。"
    },
    {
      userName: "巍峨哇",
      time: "2017-08-24 22:04:08",
      good: 117,
      bad: 49,
      con: "风景很美，缆车非常的平稳，不错不错，省去了很多爬山的辛苦，提高了旅游的舒适度，节省了很多的时间，随手一拍都是美景，非常享受啊"
    },
    {
      userName: "匿名用户",
      time: "2017-11-14 17:24:17",
      good: 8,
      bad: 1,
      con: "五岳归来不看山，黄山归来不看岳。 黄山雪景真绝美！这次黄山之行看到了雾凇、雪景、日出、云海，非常圆满。黄山上的配套设备及服务也非常完善，上厕所出来听到几个南方小伙感慨：太奢侈了，厕所还有热水洗手和暖气！"
    },
    {
      userName: "无昵称用户",
      time: "2017-10-30 15:17:50",
      good: 6,
      bad: 1,
      con: "山之行，绝对超妙，来此一趟，此生无憾。 大美黄山，银装素裹，莲花峰巅，灿若星辰。 携老提幼，兴致勃勃，大好河山，尽收眼底。 迎客之松，大气磅礴，光明之頂，一览无余。 总结：绝美黄山，不虚此行。"
    },
    {
      userName: "无昵称用户",
      time: "2017-10-19 13:07:17",
      good: 0,
      bad: 3,
      con: "在携程上预定，刷身份证就能进入大门，也可以坐缆车，免去排队买票的时间，非常方便，而且黄山每天上山人数有限制，如果人太多，那就没有票可以买了，推荐大家提前在携程上买票"
    }
    ]
    },



    //第六本书
    {
      //书的信息
      BookInformation: {
        bookName: "灵隐寺",
        author: "4.7",
        press: "无",
        year: "观光游玩",
        price: "杭州市西湖区灵隐路法云弄1号",
        Binding: "无",
        // folio: "32",
        ISBN: "0571-87968665",
        imgUrl: "./img/25.jpg",
        authorIntro: "儿童：年龄6周岁（含）以下或身高1.2米（含）以下，免费军人：现役军人，凭有效证件，免费残疾人：凭有效证件，免费老人：70周岁以上，免费；60-69周岁，半价免票人群：浙江省内30年以上教龄的教师、离休干部、杭州人才、警官证，免费",
        //图书标签
        bookLabel: ['云林寺', '求愿', ],
        //主题词
        themaWords: ['天王殿', '济公'],
        //内容提要
        contentSummary: '灵隐寺又称“云林寺”，坐落于西湖西面的灵隐山麓。寺内环境清幽，是杭州最早的名刹，留存着各朝代众多精美文物。这里是济公的出家地，据说求愿很灵验，每天来礼佛祈福的香客络绎不绝。一千七百年的风雨，使灵隐寺成为历史与文化的宝库：天王殿上悬“云林禅寺”匾额，为清康熙帝所题；大雄宝殿前的石塔、天王殿前的石经幢均是五代十国吴越时的遗物；寺内珍藏的佛教文物有古代贝叶写经、东魏镏金佛像、明董其昌写本《金刚经》、清雍正木刻龙藏等珍贵宝物。灵隐寺还是“济公”道济和尚出家的寺庙，在道济禅师殿中供奉的一尊右手拿破扇、左手持念珠、右脚搁在酒缸上的佛像便是济公像。',
        //本书目录
        catalogues:[ '无']
      },
      //同类书籍
    similarBook: [
       {
         bookName: "故宫博物院",
         author: "4.8",
         press: "5A",
         year: "地标景点",
         ISBN: "4009501925",
         imgUrl: "./img/28.jpg"
       },
         {
           bookName: "北京环球度假区",
           author: "4.5",
           press: "无",
           year: "亲子乐园",
           ISBN: "4000 688 688",
           imgUrl: "./images/21.jpg"
         },
      {
        bookName: "拙政园",
        author: "4.6",
        press: "5A",
        year: "赏花踏青",
        ISBN: "0512-962015",
        imgUrl: "./img/29.jpg"
      },
      {
        bookName: "夫子庙",
        author: "4.7",
        press: "无",
        year: "观光游玩",
        ISBN: "025-52209788,025-52855667",
        imgUrl: "./img/30.jpg"
      },
      {
        bookName: "三亚亚特兰蒂斯度假区",
        author: "4.6",
        press: "无",
        year: "水下乐园",
        ISBN: "0898-88986666",
        imgUrl: "./img/22.jpg"
      },
       
       ],
       //购买推荐
       PurchaseRe: [{
         libraryName: "西湖",
         address: "杭州市西湖风景名胜区"
       },
       {
         libraryName: "杭州宋城",
         address: "杭州市西湖区之江路148号"
       },
       {
         libraryName: "千岛湖景区",
         address: "杭州市淳安县千岛湖镇梦姑路348号千岛湖中心湖区游船码头"
       },
       {
         libraryName: "上海迪士尼度假区",
         address: "上海市浦东新区川沙新镇黄赵路310号"
       },
       {
         libraryName: "东方明珠",
         address: "上海市浦东新区陆家嘴世纪大道1号"
       },
       {
         libraryName: "成都大熊猫繁育研究基地",
         address: "成都市成华区外北熊猫大道1375号"
       }
       ],
       //借阅推荐
       borrowRe: [{
         libraryName: "钟鼓索道",
         address: "福建省厦门市思明区虎园路31号"
       },
       {
         libraryName: "鼓浪屿",
         address: "厦门市思明区鼓浪屿"
       }
       ],
       comment: [{
         userName: "无昵称用户",
         time: "2017-12-10 08:08:45",
         good: 3,
         bad: 3,
         con: "登黄山天下无山 疫情后第一次出行就给了黄山，距离上一次登黄山已经18年了，这次看到了日落，第二天错过了日出，但是回头看到一轮圆月挂在晴空，原来一切都是最好的安排！"
       },
       {
         userName: "叫.。。",
         time: "2017-11-14 14:27:05",
         good: 94,
         bad: 17,
         con: "赶上好天气，看到了一年中难得一见的云海。“不做天上仙，愿为黄山客”黄山奇石、怪松、云海、险峰，太美了。俗话说，黄山归来不看岳。我建议后山坐云谷索道上山，玉屏索道下山，这样比较节约体力。"
       },
       {
         userName: "巍峨哇",
         time: "2017-08-24 22:04:08",
         good: 117,
         bad: 49,
         con: "风景很美，缆车非常的平稳，不错不错，省去了很多爬山的辛苦，提高了旅游的舒适度，节省了很多的时间，随手一拍都是美景，非常享受啊"
       },
       {
         userName: "匿名用户",
         time: "2017-11-14 17:24:17",
         good: 8,
         bad: 1,
         con: "五岳归来不看山，黄山归来不看岳。 黄山雪景真绝美！这次黄山之行看到了雾凇、雪景、日出、云海，非常圆满。黄山上的配套设备及服务也非常完善，上厕所出来听到几个南方小伙感慨：太奢侈了，厕所还有热水洗手和暖气！"
       },
       {
         userName: "无昵称用户",
         time: "2017-10-30 15:17:50",
         good: 6,
         bad: 1,
         con: "山之行，绝对超妙，来此一趟，此生无憾。 大美黄山，银装素裹，莲花峰巅，灿若星辰。 携老提幼，兴致勃勃，大好河山，尽收眼底。 迎客之松，大气磅礴，光明之頂，一览无余。 总结：绝美黄山，不虚此行。"
       },
       {
         userName: "无昵称用户",
         time: "2017-10-19 13:07:17",
         good: 0,
         bad: 3,
         con: "在携程上预定，刷身份证就能进入大门，也可以坐缆车，免去排队买票的时间，非常方便，而且黄山每天上山人数有限制，如果人太多，那就没有票可以买了，推荐大家提前在携程上买票"
       }
       ]
    },



    //第七本书
    {
      //书的信息
      BookInformation: {
        bookName: "台北故宫博物院",
        author: "4.7",
        press: "无",
        year: "亲子乐园",
        price: "台北市士林区至善路二段221号",
        Binding: "无",
        folio: "32",
        ISBN: "886-2-28812021",
        imgUrl: "./img/26.jpg",
        authorIntro: "童车租赁：参考价格：请咨询景区；地址：第一展览区一楼寄物处轮椅租赁：参考价格：请咨询景区；地址：第一展览区一楼寄物处母婴室：地址：台北故宫博物院第一展览区 B1 入口大厅两侧设有哺乳室，可供游客免费使用。残障通道：台北故宫博物院入口大厅西侧，一楼后备有无障碍电梯；一楼东侧电梯旁设有无障碍厕所。餐饮：台北故宫博物院内设有多个餐厅，分别在第一展览区一楼东侧，第二展览区，至善园入口左侧等附近。纪念品商店：台北故宫博物院内设有多个纪念品商店，多宝格位于正馆B1层，09:00~19:00开放，每周五、六皆配合展览延长营业时间至21:30。停云书店、玲珑馆、宝绘廊位于正馆2层。",
        //图书标签
        bookLabel: ['中国传统宫殿',],
        //主题词
        themaWords: ['翠玉白菜', '毛公鼎'],
        //内容提要
        contentSummary: '台北故宫博物院位于台北士林区，外观为中国传统宫殿建筑。博物院集中华文物之大成，收藏各类文物珍宝约65万件，素有“北京故宫看建筑，台北故宫看文物”的说法。展馆会每三个月更换一次展品，还有不定期的特展展出。',
        //本书目录
        catalogues: ['无']
      },
      //同类书籍
     similarBook: [{
          bookName: "黄山风景区",
          author: "4.7",
          press: "5A",
          year: "山水景点",
          ISBN: "0559-2590999",
          imgUrl: "./images/20.jpg",
        },
        {
          bookName: "北京环球度假区",
          author: "4.5",
          press: "无",
          year: "亲子乐园",
          ISBN: "4000 688 688",
          imgUrl: "./images/21.jpg"
        },
        {
          bookName: "普陀山风景区",
          author: "4.7",
          press: "5A",
          year: "山水景点",
          ISBN: "0580-3191919,0580-3889090",
          imgUrl: "./img/23.jpg"
        },
     {
       bookName: "夫子庙",
       author: "4.7",
       press: "无",
       year: "观光游玩",
       ISBN: "025-52209788,025-52855667",
       imgUrl: "./img/30.jpg"
     },
        {
          bookName: "灵隐寺",
          author: "4.7",
          press: "无",
          year: "观光游玩",
          ISBN: "0571-87968665",
          imgUrl: "./img/25.jpg"
        },
      
      ],
      //购买推荐
      PurchaseRe: [{
        libraryName: "西湖",
        address: "杭州市西湖风景名胜区"
      },
      {
        libraryName: "杭州宋城",
        address: "杭州市西湖区之江路148号"
      },
      {
        libraryName: "千岛湖景区",
        address: "杭州市淳安县千岛湖镇梦姑路348号千岛湖中心湖区游船码头"
      },
      {
        libraryName: "上海迪士尼度假区",
        address: "上海市浦东新区川沙新镇黄赵路310号"
      },
      {
        libraryName: "东方明珠",
        address: "上海市浦东新区陆家嘴世纪大道1号"
      },
      {
        libraryName: "成都大熊猫繁育研究基地",
        address: "成都市成华区外北熊猫大道1375号"
      }
      ],
      //借阅推荐
      borrowRe: [{
        libraryName: "钟鼓索道",
        address: "福建省厦门市思明区虎园路31号"
      },
      {
        libraryName: "鼓浪屿",
        address: "厦门市思明区鼓浪屿"
      }
      ],
      comment: [{
        userName: "无昵称用户",
        time: "2017-12-10 08:08:45",
        good: 3,
        bad: 3,
        con: "登黄山天下无山 疫情后第一次出行就给了黄山，距离上一次登黄山已经18年了，这次看到了日落，第二天错过了日出，但是回头看到一轮圆月挂在晴空，原来一切都是最好的安排！"
      },
      {
        userName: "叫.。。",
        time: "2017-11-14 14:27:05",
        good: 94,
        bad: 17,
        con: "赶上好天气，看到了一年中难得一见的云海。“不做天上仙，愿为黄山客”黄山奇石、怪松、云海、险峰，太美了。俗话说，黄山归来不看岳。我建议后山坐云谷索道上山，玉屏索道下山，这样比较节约体力。"
      },
      {
        userName: "巍峨哇",
        time: "2017-08-24 22:04:08",
        good: 117,
        bad: 49,
        con: "风景很美，缆车非常的平稳，不错不错，省去了很多爬山的辛苦，提高了旅游的舒适度，节省了很多的时间，随手一拍都是美景，非常享受啊"
      },
      {
        userName: "匿名用户",
        time: "2017-11-14 17:24:17",
        good: 8,
        bad: 1,
        con: "五岳归来不看山，黄山归来不看岳。 黄山雪景真绝美！这次黄山之行看到了雾凇、雪景、日出、云海，非常圆满。黄山上的配套设备及服务也非常完善，上厕所出来听到几个南方小伙感慨：太奢侈了，厕所还有热水洗手和暖气！"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-30 15:17:50",
        good: 6,
        bad: 1,
        con: "山之行，绝对超妙，来此一趟，此生无憾。 大美黄山，银装素裹，莲花峰巅，灿若星辰。 携老提幼，兴致勃勃，大好河山，尽收眼底。 迎客之松，大气磅礴，光明之頂，一览无余。 总结：绝美黄山，不虚此行。"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-19 13:07:17",
        good: 0,
        bad: 3,
        con: "在携程上预定，刷身份证就能进入大门，也可以坐缆车，免去排队买票的时间，非常方便，而且黄山每天上山人数有限制，如果人太多，那就没有票可以买了，推荐大家提前在携程上买票"
      }
      ]
    },



    //第八本书
    {
      //书的信息
      BookInformation: {
        bookName: "西门町",
        author: "4.6",
        press: "无",
        year: "观光乐园",
        price: "台北市万华区成都路、中华路、武昌街、西宁南路等街区",
        Binding: "无",
        // folio: "32",
        ISBN: " 886-2-7208889",
        imgUrl: "./img/27.jpg",
        authorIntro: "无",
        //图书标签
        bookLabel: ['原宿', '哈日族',],
        //主题词
        themaWords: ['商业步行街'],
        //内容提要
        contentSummary: '西门町也是知名的电影街，在台北看首映，来这里准没错。几乎每个周末，这里都有小型演唱会、签唱会、唱片首卖会，各种电影宣传、街头表演活动也常常可见。要感受西门町的气氛，建议傍晚来，这时人潮汇聚相当热闹。来西门町逛也不能忘记尝尝这里的美味，推荐李天禄卤味和阿宗面线、日式料理店“美观园”、小吃“鸭肉扁”，价格实惠性价比高，你还可以去西门红楼去逛逛，周边如万华龙山寺、台北车站、台湾历史博物馆也是必游景点哦！',
        //本书目录
        catalogues: ['具体营业状态以当天开放情况为准']
      },
      //同类书籍
   similarBook: [
      {
        bookName: "台北故宫博物院",
        author: "4.8",
        press: "5A",
        year: "亲子乐园",
        ISBN: "4009501925",
        imgUrl: "./img/28.jpg"
      },
        {
          bookName: "北京环球度假区",
          author: "4.5",
          press: "无",
          year: "亲子乐园",
          ISBN: "4000 688 688",
          imgUrl: "./images/21.jpg"
        },
     {
       bookName: "拙政园",
       author: "4.6",
       press: "5A",
       year: "赏花踏青",
       ISBN: "0512-962015",
       imgUrl: "./img/29.jpg"
     },
     {
       bookName: "夫子庙",
       author: "4.7",
       press: "无",
       year: "观光游玩",
       ISBN: "025-52209788,025-52855667",
       imgUrl: "./img/30.jpg"
     },
     {
       bookName: "三亚亚特兰蒂斯度假区",
       author: "4.6",
       press: "无",
       year: "水下乐园",
       ISBN: "0898-88986666",
       imgUrl: "./img/22.jpg"
     },
      
      ],
      //购买推荐
      PurchaseRe: [{
        libraryName: "西湖",
        address: "杭州市西湖风景名胜区"
      },
      {
        libraryName: "杭州宋城",
        address: "杭州市西湖区之江路148号"
      },
      {
        libraryName: "千岛湖景区",
        address: "杭州市淳安县千岛湖镇梦姑路348号千岛湖中心湖区游船码头"
      },
      {
        libraryName: "上海迪士尼度假区",
        address: "上海市浦东新区川沙新镇黄赵路310号"
      },
      {
        libraryName: "东方明珠",
        address: "上海市浦东新区陆家嘴世纪大道1号"
      },
      {
        libraryName: "成都大熊猫繁育研究基地",
        address: "成都市成华区外北熊猫大道1375号"
      }
      ],
      //借阅推荐
      borrowRe: [{
        libraryName: "钟鼓索道",
        address: "福建省厦门市思明区虎园路31号"
      },
      {
        libraryName: "鼓浪屿",
        address: "厦门市思明区鼓浪屿"
      }
      ],
      comment: [{
        userName: "无昵称用户",
        time: "2017-12-10 08:08:45",
        good: 3,
        bad: 3,
        con: "登黄山天下无山 疫情后第一次出行就给了黄山，距离上一次登黄山已经18年了，这次看到了日落，第二天错过了日出，但是回头看到一轮圆月挂在晴空，原来一切都是最好的安排！"
      },
      {
        userName: "叫.。。",
        time: "2017-11-14 14:27:05",
        good: 94,
        bad: 17,
        con: "赶上好天气，看到了一年中难得一见的云海。“不做天上仙，愿为黄山客”黄山奇石、怪松、云海、险峰，太美了。俗话说，黄山归来不看岳。我建议后山坐云谷索道上山，玉屏索道下山，这样比较节约体力。"
      },
      {
        userName: "巍峨哇",
        time: "2017-08-24 22:04:08",
        good: 117,
        bad: 49,
        con: "风景很美，缆车非常的平稳，不错不错，省去了很多爬山的辛苦，提高了旅游的舒适度，节省了很多的时间，随手一拍都是美景，非常享受啊"
      },
      {
        userName: "匿名用户",
        time: "2017-11-14 17:24:17",
        good: 8,
        bad: 1,
        con: "五岳归来不看山，黄山归来不看岳。 黄山雪景真绝美！这次黄山之行看到了雾凇、雪景、日出、云海，非常圆满。黄山上的配套设备及服务也非常完善，上厕所出来听到几个南方小伙感慨：太奢侈了，厕所还有热水洗手和暖气！"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-30 15:17:50",
        good: 6,
        bad: 1,
        con: "山之行，绝对超妙，来此一趟，此生无憾。 大美黄山，银装素裹，莲花峰巅，灿若星辰。 携老提幼，兴致勃勃，大好河山，尽收眼底。 迎客之松，大气磅礴，光明之頂，一览无余。 总结：绝美黄山，不虚此行。"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-19 13:07:17",
        good: 0,
        bad: 3,
        con: "在携程上预定，刷身份证就能进入大门，也可以坐缆车，免去排队买票的时间，非常方便，而且黄山每天上山人数有限制，如果人太多，那就没有票可以买了，推荐大家提前在携程上买票"
      }
      ]
    },




    //第九本书
    {
      //书的信息
      BookInformation: {
        bookName: "故宫博物院",
        author: "4.8",
        press: "5A",
        year: "地标景点",
        price: "北京市东城区景山前街4号",
        Binding: "无",
        // folio: "32",
        ISBN: "4009501925",
        imgUrl: "./img/28.jpg",
        authorIntro: "行李寄存：参考价格：现场为准；地址：午门与神武门外东侧；存包行李可在午门（南门）至神武门（北门）之间免费运送ATM机：故宫博物馆内设2处ATM机，具体位置可在故宫博物院官方网站查看。餐饮：分别在隆宗门、景运门、箭亭、养心殿、神宁宫（有2家）附近设有餐厅。纪念品商店：故宫景区内设有20家商店，分别在武英殿（1家）、文华殿（1家）、景运门（2家）、养心殿（1家）、乾清宫（3家）、交秦殿（2家）、御花园（6家）、乾隆花园（1家）、皇极店（2家）、神武门（1家）附近。便利店：园内设有便利店，分别在景区入口、出口处及中途游览道路两侧、坤宁宫、交泰殿、神武门等附近。可使用支付宝/微信支付。",
        //图书标签
        bookLabel: ['紫禁城', '皇宫', ],
        //主题词
        themaWords: ['小说', '刑侦'],
        //内容提要
        contentSummary: '故宫又称紫禁城，是明、清两代的皇宫，也是古老中国的标志和象征。当你置身于气派规整的高墙深院，能真真切切地感受到它曾经的荣耀。悠久的历史给这里留下了大规模的珍贵建筑和无数文物，也成为今天游玩故宫的主要看点。',
        //本书目录
        catalogues: ['清明节,劳动节,端午节,中秋节,国庆节 07:30-17:00（16:10停止入园），元旦节,春节 08:30-16:30（15:40停止入园）；法定节假日周一不闭馆；停止入园时间含钟表馆、珍宝馆']
      },
      //同类书籍
 similarBook: [
      {
        bookName: "台北故宫博物院",
        author: "4.8",
        press: "5A",
        year: "亲子乐园",
        ISBN: "4009501925",
        imgUrl: "./img/28.jpg"
      },
        {
          bookName: "北京环球度假区",
          author: "4.5",
          press: "无",
          year: "亲子乐园",
          ISBN: "4000 688 688",
          imgUrl: "./images/21.jpg"
        },
     {
       bookName: "拙政园",
       author: "4.6",
       press: "5A",
       year: "赏花踏青",
       ISBN: "0512-962015",
       imgUrl: "./img/29.jpg"
     },
     {
       bookName: "夫子庙",
       author: "4.7",
       press: "无",
       year: "观光游玩",
       ISBN: "025-52209788,025-52855667",
       imgUrl: "./img/30.jpg"
     },
     {
       bookName: "三亚亚特兰蒂斯度假区",
       author: "4.6",
       press: "无",
       year: "水下乐园",
       ISBN: "0898-88986666",
       imgUrl: "./img/22.jpg"
     },
      
      ],
      //购买推荐
      PurchaseRe: [{
        libraryName: "西湖",
        address: "杭州市西湖风景名胜区"
      },
      {
        libraryName: "杭州宋城",
        address: "杭州市西湖区之江路148号"
      },
      {
        libraryName: "千岛湖景区",
        address: "杭州市淳安县千岛湖镇梦姑路348号千岛湖中心湖区游船码头"
      },
      {
        libraryName: "上海迪士尼度假区",
        address: "上海市浦东新区川沙新镇黄赵路310号"
      },
      {
        libraryName: "东方明珠",
        address: "上海市浦东新区陆家嘴世纪大道1号"
      },
      {
        libraryName: "成都大熊猫繁育研究基地",
        address: "成都市成华区外北熊猫大道1375号"
      }
      ],
      //借阅推荐
      borrowRe: [{
        libraryName: "钟鼓索道",
        address: "福建省厦门市思明区虎园路31号"
      },
      {
        libraryName: "鼓浪屿",
        address: "厦门市思明区鼓浪屿"
      }
      ],
      comment: [{
        userName: "无昵称用户",
        time: "2017-12-10 08:08:45",
        good: 3,
        bad: 3,
        con: "登黄山天下无山 疫情后第一次出行就给了黄山，距离上一次登黄山已经18年了，这次看到了日落，第二天错过了日出，但是回头看到一轮圆月挂在晴空，原来一切都是最好的安排！"
      },
      {
        userName: "叫.。。",
        time: "2017-11-14 14:27:05",
        good: 94,
        bad: 17,
        con: "赶上好天气，看到了一年中难得一见的云海。“不做天上仙，愿为黄山客”黄山奇石、怪松、云海、险峰，太美了。俗话说，黄山归来不看岳。我建议后山坐云谷索道上山，玉屏索道下山，这样比较节约体力。"
      },
      {
        userName: "巍峨哇",
        time: "2017-08-24 22:04:08",
        good: 117,
        bad: 49,
        con: "风景很美，缆车非常的平稳，不错不错，省去了很多爬山的辛苦，提高了旅游的舒适度，节省了很多的时间，随手一拍都是美景，非常享受啊"
      },
      {
        userName: "匿名用户",
        time: "2017-11-14 17:24:17",
        good: 8,
        bad: 1,
        con: "五岳归来不看山，黄山归来不看岳。 黄山雪景真绝美！这次黄山之行看到了雾凇、雪景、日出、云海，非常圆满。黄山上的配套设备及服务也非常完善，上厕所出来听到几个南方小伙感慨：太奢侈了，厕所还有热水洗手和暖气！"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-30 15:17:50",
        good: 6,
        bad: 1,
        con: "山之行，绝对超妙，来此一趟，此生无憾。 大美黄山，银装素裹，莲花峰巅，灿若星辰。 携老提幼，兴致勃勃，大好河山，尽收眼底。 迎客之松，大气磅礴，光明之頂，一览无余。 总结：绝美黄山，不虚此行。"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-19 13:07:17",
        good: 0,
        bad: 3,
        con: "在携程上预定，刷身份证就能进入大门，也可以坐缆车，免去排队买票的时间，非常方便，而且黄山每天上山人数有限制，如果人太多，那就没有票可以买了，推荐大家提前在携程上买票"
      }
      ]
    },



    //第十本书
    {
      //书的信息
      BookInformation: {
        bookName: "拙政园",
        author: "4.6",
        press: "5A",
        year: "赏花踏青",
        price: "苏州市姑苏区东北街178号",
        Binding: "无",
        // folio: "32",
        ISBN: "0512-962015",
        imgUrl: "./img/29.jpg",
        authorIntro: "景区讲解：拙政园游客中心提供人工讲解服务，费用：免费。景区地图：景区游客中心提供景区地图，需要的游客可自取查阅。讲解器租赁：参考价格：20元/次；地址：在西入口处的小木亭雨具租赁：参考价格：免费使用，但是需要押本人身份证；地址：游客中心卫生间：拙政园内设有多个卫生间，分别在东出口处、入口处的东北角等附近并标有醒目的指示牌。母婴室：地址：拙政园内在卫生间内设有母婴室，分别在东出口处、入口处的东北角等附近。纪念品商店：景区北门处设有商业街。自动售卖机：景区游客中心提供自动贩卖机，游客中心服务时间：7:30-16:30。",
        //图书标签
        bookLabel: ['中国四大名园之一',],
        //主题词
        themaWords: ['兰雪堂、涵青亭、远香堂'],
        //内容提要
        contentSummary: '拙政园是苏州有名的园林，全园以水为中心，萦绕错落有致的假山及精致的庭院建筑，花木并茂。这一江南园林典范与北京颐和园、承德避暑山庄、苏州留园并称为“中国四大名园”，并被列入世界文化遗产名录。',
        //本书目录
        catalogues: ['无']
      },
      //同类书籍
     similarBook: [
        {
          bookName: "台北故宫博物院",
          author: "4.8",
          press: "5A",
          year: "亲子乐园",
          ISBN: "4009501925",
          imgUrl: "./img/28.jpg"
        },
          {
               bookName: "黄山风景区",
               author: "4.7",
               press: "5A",
               year: "山水景点",
               ISBN: "0559-2590999",
               imgUrl: "./images/20.jpg",
             },
             {
               bookName: "北京环球度假区",
               author: "4.5",
               press: "无",
               year: "亲子乐园",
               ISBN: "4000 688 688",
               imgUrl: "./images/21.jpg"
             },
             {
               bookName: "普陀山风景区",
               author: "4.7",
               press: "5A",
               year: "山水景点",
               ISBN: "0580-3191919,0580-3889090",
               imgUrl: "./img/23.jpg"
             },
       {
         bookName: "三亚亚特兰蒂斯度假区",
         author: "4.6",
         press: "无",
         year: "水下乐园",
         ISBN: "0898-88986666",
         imgUrl: "./img/22.jpg"
       },
        
        ],
        //购买推荐
        PurchaseRe: [{
          libraryName: "西湖",
          address: "杭州市西湖风景名胜区"
        },
        {
          libraryName: "杭州宋城",
          address: "杭州市西湖区之江路148号"
        },
        {
          libraryName: "千岛湖景区",
          address: "杭州市淳安县千岛湖镇梦姑路348号千岛湖中心湖区游船码头"
        },
        {
          libraryName: "上海迪士尼度假区",
          address: "上海市浦东新区川沙新镇黄赵路310号"
        },
        {
          libraryName: "东方明珠",
          address: "上海市浦东新区陆家嘴世纪大道1号"
        },
        {
          libraryName: "成都大熊猫繁育研究基地",
          address: "成都市成华区外北熊猫大道1375号"
        }
        ],
        //借阅推荐
        borrowRe: [{
          libraryName: "钟鼓索道",
          address: "福建省厦门市思明区虎园路31号"
        },
        {
          libraryName: "鼓浪屿",
          address: "厦门市思明区鼓浪屿"
        }
        ],
        comment: [{
          userName: "无昵称用户",
          time: "2017-12-10 08:08:45",
          good: 3,
          bad: 3,
          con: "登黄山天下无山 疫情后第一次出行就给了黄山，距离上一次登黄山已经18年了，这次看到了日落，第二天错过了日出，但是回头看到一轮圆月挂在晴空，原来一切都是最好的安排！"
        },
        {
          userName: "叫.。。",
          time: "2017-11-14 14:27:05",
          good: 94,
          bad: 17,
          con: "赶上好天气，看到了一年中难得一见的云海。“不做天上仙，愿为黄山客”黄山奇石、怪松、云海、险峰，太美了。俗话说，黄山归来不看岳。我建议后山坐云谷索道上山，玉屏索道下山，这样比较节约体力。"
        },
        {
          userName: "巍峨哇",
          time: "2017-08-24 22:04:08",
          good: 117,
          bad: 49,
          con: "风景很美，缆车非常的平稳，不错不错，省去了很多爬山的辛苦，提高了旅游的舒适度，节省了很多的时间，随手一拍都是美景，非常享受啊"
        },
        {
          userName: "匿名用户",
          time: "2017-11-14 17:24:17",
          good: 8,
          bad: 1,
          con: "五岳归来不看山，黄山归来不看岳。 黄山雪景真绝美！这次黄山之行看到了雾凇、雪景、日出、云海，非常圆满。黄山上的配套设备及服务也非常完善，上厕所出来听到几个南方小伙感慨：太奢侈了，厕所还有热水洗手和暖气！"
        },
        {
          userName: "无昵称用户",
          time: "2017-10-30 15:17:50",
          good: 6,
          bad: 1,
          con: "山之行，绝对超妙，来此一趟，此生无憾。 大美黄山，银装素裹，莲花峰巅，灿若星辰。 携老提幼，兴致勃勃，大好河山，尽收眼底。 迎客之松，大气磅礴，光明之頂，一览无余。 总结：绝美黄山，不虚此行。"
        },
        {
          userName: "无昵称用户",
          time: "2017-10-19 13:07:17",
          good: 0,
          bad: 3,
          con: "在携程上预定，刷身份证就能进入大门，也可以坐缆车，免去排队买票的时间，非常方便，而且黄山每天上山人数有限制，如果人太多，那就没有票可以买了，推荐大家提前在携程上买票"
        }
        ]
    },



    //的十一本书
    {
      //书的信息
      BookInformation: {
        bookName: "夫子庙",
        author: "4.7",
        press: "无",
        year: "观光游玩",
        price: "南京市秦淮区秦淮河风景区",
        Binding: "无",
        // folio: "32",
        ISBN: "025-52209788,025-52855667",
        authorIntro: "停车场：【来燕商城停车场】参考价格：¥8/小时；地址：来燕路与乌衣巷交汇处；库位：61 WIFI：账号：i-NanJing-Free；密码：验证登录；范围：景区内卫生间：景区内设有卫生间，分别在得月台、太平天国博物馆、中华门 等设施附近，并标有醒目的指示牌。母婴室：地址：景区内设有母婴室便利店：景区有多个便利店，位于景区主干道附近，可以支持微信支付宝支付",
        imgUrl: "./img/30.jpg",
        bookLabel:['宋代', '孔子',],
        //主题词
        themaWords: ['春节灯会'],
        //内容提要
        contentSummary: ' 夫子庙始建于宋代，位于秦淮河北岸的贡院街旁，原是祀奉孔子的地方，后多次遭毁并重建。它与北京孔庙、曲阜孔庙、吉林文庙并称为中国四大文庙，也是夫子庙秦淮河风光带主要的景点。',
        //本书目录
        catalogues: ['无']
      },
similarBook: [
        {
          bookName: "台北故宫博物院",
          author: "4.8",
          press: "5A",
          year: "亲子乐园",
          ISBN: "4009501925",
          imgUrl: "./img/28.jpg"
        },
          {
               bookName: "黄山风景区",
               author: "4.7",
               press: "5A",
               year: "山水景点",
               ISBN: "0559-2590999",
               imgUrl: "./images/20.jpg",
             },
             {
               bookName: "北京环球度假区",
               author: "4.5",
               press: "无",
               year: "亲子乐园",
               ISBN: "4000 688 688",
               imgUrl: "./images/21.jpg"
             },
             {
               bookName: "普陀山风景区",
               author: "4.7",
               press: "5A",
               year: "山水景点",
               ISBN: "0580-3191919,0580-3889090",
               imgUrl: "./img/23.jpg"
             },
       {
         bookName: "三亚亚特兰蒂斯度假区",
         author: "4.6",
         press: "无",
         year: "水下乐园",
         ISBN: "0898-88986666",
         imgUrl: "./img/22.jpg"
       },
        
        ],
        //购买推荐
        PurchaseRe: [{
          libraryName: "西湖",
          address: "杭州市西湖风景名胜区"
        },
        {
          libraryName: "杭州宋城",
          address: "杭州市西湖区之江路148号"
        },
        {
          libraryName: "千岛湖景区",
          address: "杭州市淳安县千岛湖镇梦姑路348号千岛湖中心湖区游船码头"
        },
        {
          libraryName: "上海迪士尼度假区",
          address: "上海市浦东新区川沙新镇黄赵路310号"
        },
        {
          libraryName: "东方明珠",
          address: "上海市浦东新区陆家嘴世纪大道1号"
        },
        {
          libraryName: "成都大熊猫繁育研究基地",
          address: "成都市成华区外北熊猫大道1375号"
        }
        ],
        //借阅推荐
        borrowRe: [{
          libraryName: "钟鼓索道",
          address: "福建省厦门市思明区虎园路31号"
        },
        {
          libraryName: "鼓浪屿",
          address: "厦门市思明区鼓浪屿"
        }
        ],
        comment: [{
          userName: "无昵称用户",
          time: "2017-12-10 08:08:45",
          good: 3,
          bad: 3,
          con: "登黄山天下无山 疫情后第一次出行就给了黄山，距离上一次登黄山已经18年了，这次看到了日落，第二天错过了日出，但是回头看到一轮圆月挂在晴空，原来一切都是最好的安排！"
        },
        {
          userName: "叫.。。",
          time: "2017-11-14 14:27:05",
          good: 94,
          bad: 17,
          con: "赶上好天气，看到了一年中难得一见的云海。“不做天上仙，愿为黄山客”黄山奇石、怪松、云海、险峰，太美了。俗话说，黄山归来不看岳。我建议后山坐云谷索道上山，玉屏索道下山，这样比较节约体力。"
        },
        {
          userName: "巍峨哇",
          time: "2017-08-24 22:04:08",
          good: 117,
          bad: 49,
          con: "风景很美，缆车非常的平稳，不错不错，省去了很多爬山的辛苦，提高了旅游的舒适度，节省了很多的时间，随手一拍都是美景，非常享受啊"
        },
        {
          userName: "匿名用户",
          time: "2017-11-14 17:24:17",
          good: 8,
          bad: 1,
          con: "五岳归来不看山，黄山归来不看岳。 黄山雪景真绝美！这次黄山之行看到了雾凇、雪景、日出、云海，非常圆满。黄山上的配套设备及服务也非常完善，上厕所出来听到几个南方小伙感慨：太奢侈了，厕所还有热水洗手和暖气！"
        },
        {
          userName: "无昵称用户",
          time: "2017-10-30 15:17:50",
          good: 6,
          bad: 1,
          con: "山之行，绝对超妙，来此一趟，此生无憾。 大美黄山，银装素裹，莲花峰巅，灿若星辰。 携老提幼，兴致勃勃，大好河山，尽收眼底。 迎客之松，大气磅礴，光明之頂，一览无余。 总结：绝美黄山，不虚此行。"
        },
        {
          userName: "无昵称用户",
          time: "2017-10-19 13:07:17",
          good: 0,
          bad: 3,
          con: "在携程上预定，刷身份证就能进入大门，也可以坐缆车，免去排队买票的时间，非常方便，而且黄山每天上山人数有限制，如果人太多，那就没有票可以买了，推荐大家提前在携程上买票"
        }
        ]}
		,
    //第十二本书
    {
      //书的信息
      BookInformation: {
        bookName: "你所谓的稳定，不过是在浪费生命",
        author: "李尚龙",
        press: "中南出版传媒集团股份有限公司",
        year: "2016-02",
        price: "38.00",
        Binding: "精装",
        folio: "32",
        ISBN: "9787540474485",
        imgUrl: "./img/1000023.jpg",
        authorIntro: "青年导演、作家、前新东方老师",
        //图书标签
        bookLabel: ['文学', '励志', '小说',],
        //主题词
        themaWords: ['小说', '现代文学'],
        //内容提要
        contentSummary: '     本书是继百万畅销书《你只是看起来很努力》后，中国优质新偶像李尚龙写给所有怀揣梦想、逆风奔跑的年轻人的激励之书。不要为了*丢掉生活，为了稳定丢掉青春，为了平淡丢掉梦想，因为你所谓的稳定，不过是在浪费生命。',
        //本书目录
        catalogues: ['序　言ONE你所谓的稳定，不过是在浪费生命TWO只要没被世界改变，就改变了世界THREE讲些故事，为了让你相信爱情']
      },
      //同类书籍
      similarBook: [{
        bookName: "笨狼的故事",
        author: "汤素兰",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-09",
        ISBN: "9787556204731",
        imgUrl: "./img/1000048.jpg"
      },
      {
        bookName: "三生三世十里桃花",
        author: "唐七",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-06",
        ISBN: "9787540472252",
        imgUrl: "./img/1000008.jpg"
      },
      {
        bookName: "阿弥陀佛么么哒",
        author: "大冰",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-08",
        ISBN: "9787540472238",
        imgUrl: "./img/1000002.jpg"
      },
      {
        bookName: "论语解读/周读书系",
        author: "(春秋)孔子 撰;黄朴民 译注",
        press: "中南出版传媒集团股份有限公司",
        year: "2016-02",
        ISBN: "9787553804910",
        imgUrl: "./img/1000022.jpg"
      },
      {
        bookName: "离开前请叫醒我",
        author: "卢思浩",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-06",
        ISBN: "9787540472139",
        imgUrl: "./img/1000010.jpg"
      },
      ],
      //购买推荐
      PurchaseRe: [{
        libraryName: "新华书店内蒙古店",
        address: "内蒙古自治区呼和浩特市回民区中山西路49号(天元大酒店)"
      },
      {
        libraryName: "新华书店江汉路店",
        address: "汉口中山大道896号"
      },
      {
        libraryName: "新华书店街道口门市部",
        address: "洪山区武珞路800号"
      },
      {
        libraryName: "上海书城长宁店",
        address: "上海市长宁路1057号"
      },
      {
        libraryName: "上海书城353广场店",
        address: "上海市黄浦区南京东路353号悦荟mosaicF5"
      },
      {
        libraryName: "上海书城福州店",
        address: "上海市黄浦区福州路465号世纪出版大厦"
      }
      ],
      //借阅推荐
      borrowRe: [{
        libraryName: "上海图书馆",
        address: "上海市徐汇区淮海中路1555号"
      },
      {
        libraryName: "湖北省图书馆",
        address: "武汉市武昌区公正路25号"
      }
      ],
      comment: [{
        userName: "无昵称用户",
        time: "2017-12-11 1:08:45",
        good: 3,
        bad: 3,
        con: "和李尚龙以前是同行，教雅思，那种排课排到多得抓狂，上课上得想吐的感觉真的是太疲惫了！很佩服他的毅力和斗志！更佩服于他敢于挑战不同的领域，感觉突破自我！大多数选择一份工作就是一条路走到头！他知道另辟蹊径，很难得！"
      },
      {
        userName: "无昵称用户",
        time: "2017-11-14 14:27:05",
        good: 94,
        bad: 17,
        con: "别在最能拼搏的年纪选择了稳定，更别觉得这世界有什么稳定的工作，你现在的享福都是假象，都会在以后日子里还给你，生活是自己的，奋斗也不是为了别人，拼搏也是每天必做的事情，只有每天进步才是最稳定的生活。"
      },
      {
        userName: "无昵称用户",
        time: "2017-08-24 22:04:08",
        good: 117,
        bad: 49,
        con: "纸质排版各方面都不错，一直疑惑这本书的名字，作者来学校宣传时说他一直想用的名字是《你所谓的稳定》，这样就可以理解了！稳定不能说是浪费，只是这个急剧变化的世界，哪有一直的稳定，适者生存，我们得随时做好变换轨道的准备。"
      },
      {
        userName: "匿名用户",
        time: "2017-11-14 17:24:17",
        good: 8,
        bad: 1,
        con: "非常棒的一本书，一个个故事让人深省、也让人感动，书的内容远比它的书名要丰富。人生没有答案，但不能没有故事，一个好故事可以改变一个人，书中有不少这样充满正能量的动人故事。希望更多的人能读这本书"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-30 15:17:50",
        good: 6,
        bad: 1,
        con: "数次给朋友推荐了这本书，有幸在河师大聆听过李尚龙老师的英语讲座，后来得知他写书了，就买了回来。先是《你只是看起来很努力》，然后是这本的《你所谓的稳定，不过是在浪费生命》，但个人感觉这本书要比前一本好！"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-19 13:07:17",
        good: 0,
        bad: 3,
        con: "我觉得现在很多年轻人都渴望稳定，到底浪不浪费生命，只能看具体事物了"
      }
      ]
    },



    //第十三本书
    {
      //书的信息
      BookInformation: {
        bookName: "老鼠娶新娘（再版）",
        author: "张玲玲",
        press: "中文天地出版股份有限公司",
        year: "2008-01",
        price: "32.00",
        Binding: "精装",
        folio: "32",
        ISBN: "9787539140629",
        imgUrl: "./img/1000029.jpg",
        authorIntro: "张玲玲，1954年出生于台湾台北。东吴大学日文系毕业，曾于日本筑波大学专攻民间故事。现在从事台湾本土儿童文学的编辑工作。",
        //图书标签
        bookLabel: ['儿童文学', '卡通', '绘图',],
        //主题词
        themaWords: ['卡通', '儿童文学'],
        //内容提要
        contentSummary: '老鼠村长的女儿要抛绣球选新郎，一只黑猫冲进来搅乱了局面。为了女儿的幸福，老鼠村长决定找一个比猫还强、全世界*强的女婿。左思右想，他觉得太阳是全世界*强的，于是跑去找太阳。可是乌云遮住了太阳，风吹散了乌云，墙挡住了风……到底谁才是全世界*强呢？',
        //本书目录
        catalogues: ['第一章 老鼠村长','第二章 抛绣球','第三章 选新郎']
      },
      //同类书籍
      similarBook: [{
        bookName: "笨狼的故事",
        author: "汤素兰",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-09",
        ISBN: "9787556204731",
        imgUrl: "./img/1000048.jpg"
      },
      {
        bookName: "三生三世十里桃花",
        author: "唐七",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-06",
        ISBN: "9787540472252",
        imgUrl: "./img/1000008.jpg"
      },
      {
        bookName: "阿弥陀佛么么哒",
        author: "大冰",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-08",
        ISBN: "9787540472238",
        imgUrl: "./img/1000002.jpg"
      },
      {
        bookName: "论语解读/周读书系",
        author: "(春秋)孔子 撰;黄朴民 译注",
        press: "中南出版传媒集团股份有限公司",
        year: "2016-02",
        ISBN: "9787553804910",
        imgUrl: "./img/1000022.jpg"
      },
      {
        bookName: "离开前请叫醒我",
        author: "卢思浩",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-06",
        ISBN: "9787540472139",
        imgUrl: "./img/1000010.jpg"
      },
      ],
      //购买推荐
      PurchaseRe: [{
        libraryName: "云南新华大厦",
        address: "昆明市人民东路6号"
      },
      {
        libraryName: "新华书店内蒙古店",
        address: "内蒙古自治区呼和浩特市回民区中山西路49号(天元大酒店)"
      },
      {
        libraryName: "新华书店学府大道店",
        address: "南昌市新建区学府大道219号"
      },
      {
        libraryName: "新华书店老福山购书中心",
        address: "江西省南昌市西湖区八一大道102号新华大厦"
      },
      {
        libraryName: "新华书店顺城店",
        address: "四川省成都市双流区顺城街3号"
      },
      {
        libraryName: "新华书店武侯祠店",
        address: "成都市武侯区武侯祠大街266号华达商城1层"
      }
      ],
      //借阅推荐
      borrowRe: [{
        libraryName: "江西省图书馆",
        address: "江西省南昌市洪都北大道160号"
      },
      {
        libraryName: "内蒙古图书馆",
        address: "内蒙古呼和浩特市赛罕区乌兰察布西街34号"
      }
      ],
      comment: [{
        userName: "无昵称用户",
        time: "2017-12-11 1:08:45",
        good: 3,
        bad: 3,
        con: "这本书和别的绘本不一样的地方就是整个画面都是热热闹闹的红，和漂漂亮亮的古代建筑，加上故事的趣味性，我好喜欢这本绘本。"
      },
      {
        userName: "无昵称用户",
        time: "2017-11-14 14:27:05",
        good: 94,
        bad: 17,
        con: "非常美好又充满乡土味的一套书。如果说《梁山伯与祝英台》是阳春白雪的爱情，那么这本《老鼠娶新娘》就是下里巴人的爱情。图画非常细腻，画面美好精致又热闹，充满喜感。翻开书就能把人带回那个单纯又美好的，充满乡土味的小时候。"
      },
      {
        userName: "无昵称用户",
        time: "2017-08-24 22:04:08",
        good: 117,
        bad: 49,
        con: "三十多岁的人了，突然超级喜欢看绘本，打着女儿的旗号买买！！！初拿到手感觉薄薄的，但读起来篇幅还是可以的！书中有文字说明，方便深入理解图意！好的绘本认真读起来比文字书看得时间长！"
      },
      {
        userName: "匿名用户",
        time: "2017-11-14 17:24:17",
        good: 8,
        bad: 1,
        con: "5岁+的女孩很喜欢这个故事，里面的童谣（小白菜，地里黄。老鼠村，老村长。村长女儿美叮当。。。。。。）朗朗上口，小朋友说的很溜。"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-30 15:17:50",
        good: 6,
        bad: 1,
        con: "买回来讲了一遍宝宝就记住了一些情节，看到乌云就说风是最厉害的，因为会把云吹走。。。好欣慰，后来拿到幼儿园，其他小朋友也喜欢。"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-19 13:07:17",
        good: 0,
        bad: 3,
        con: "一个代代相传的民间故事生动的传说故事，动听的民间童谣，久远的娶亲习俗和精致细腻的画面构成了本书强烈的民间和中国特色。在阅读中了解传统与文化体会寓意与幽默欣赏画面与细节。"
      }
      ]
    },




    //第十四本书
    {
      //书的信息
      BookInformation: {
        bookName: "我要做一个阳刚男孩(拼音彩绘版)",
        author: "彭凡",
        press: "中文天地出版股份有限公司",
        year: "2016-09",
        price: "35.00",
        Binding: "精装",
        folio: "32",
        ISBN: "9787122267245",
        imgUrl: "./img/1000063.jpg",
        authorIntro: "彭凡少儿阅读推广人，“冰心儿童文学奖”获得者",
        //图书标签
        bookLabel: ['儿童文学', '卡通', '绘图',],
        //主题词
        themaWords: ['卡通', '儿童文学'],
        //内容提要
        contentSummary: '本书以孩子喜爱的几种动物来比喻男孩成长过程应该培养的性格，包含了100个精彩有趣的故事，其中有聪明伶俐、敦厚善良、自立自强、勤劳刻苦、勇敢无畏、坚持不懈等品质，通过故事给孩子以启发，让孩子健康成长！本书配有拼音，并有精美插图，适合4-10岁孩子阅读，引导孩子自主阅读。故事后的“大明星的话”点明了故事的主题，分享人生智慧，让孩子获得成长的力量，从而做更好更的自己，而阅读本书不仅仅能获得成长与启发，孩子可以根据每个主题，读懂名人故事，记忆精彩语句，运用到自己的作文中去，从而提高自己的写作能力。',
        //本书目录
        catalogues: ['像猴儿一样聪明伶俐', '明星传奇——齐天大圣孙悟空/8', '徐文长智取礼物/10', '智斗强盗/12', '正好与你相反/14', '100枚金币/16', '古董商买柜子/18', '与灵猴下棋/20', '穷才子和傻王子/22']
      },
      //同类书籍
      similarBook: [{
        bookName: "笨狼的故事",
        author: "汤素兰",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-09",
        ISBN: "9787556204731",
        imgUrl: "./img/1000048.jpg"
      },
      {
        bookName: "三生三世十里桃花",
        author: "唐七",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-06",
        ISBN: "9787540472252",
        imgUrl: "./img/1000008.jpg"
      },
      {
        bookName: "阿弥陀佛么么哒",
        author: "大冰",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-08",
        ISBN: "9787540472238",
        imgUrl: "./img/1000002.jpg"
      },
      {
        bookName: "论语解读/周读书系",
        author: "(春秋)孔子 撰;黄朴民 译注",
        press: "中南出版传媒集团股份有限公司",
        year: "2016-02",
        ISBN: "9787553804910",
        imgUrl: "./img/1000022.jpg"
      },
      {
        bookName: "离开前请叫醒我",
        author: "卢思浩",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-06",
        ISBN: "9787540472139",
        imgUrl: "./img/1000010.jpg"
      },
      ],
      //购买推荐
      PurchaseRe: [{
        libraryName: "新华书店芙蓉中路店",
        address: "湖南省长沙市芙蓉区芙蓉中路二段76号湖南图书城1-4层"
      },
      {
        libraryName: "新华书店河西大学店",
        address: "长沙市麓山路303号"
      },
      {
        libraryName: "北京图书大厦店",
        address: "北京市西城区西长安街17号北京图书大厦"
      },
      {
        libraryName: "新华书店顺城店",
        address: "四川省成都市双流区顺城街3号"
      },
      {
        libraryName: "新华书店老福山购书中心",
        address: " 江西省南昌市西湖区八一大道102号新华大厦"
      },
      {
        libraryName: "新华书店内蒙古店",
        address: "内蒙古自治区呼和浩特市回民区中山西路49号(天元大酒店)"
      }
      ],
      //借阅推荐
      borrowRe: [{
        libraryName: "内蒙古图书馆",
        address: "内蒙古呼和浩特市赛罕区乌兰察布西街34号"
      },
      {
        libraryName: "江西省图书馆",
        address: "江西省南昌市洪都北大道160号"
      }
      ],
      comment: [{
        userName: "无昵称用户",
        time: "2017-12-11 1:08:45",
        good: 3,
        bad: 3,
        con: "对孩子有帮助，作为课外的补充。"
      },
      {
        userName: "无昵称用户",
        time: "2017-11-14 14:27:05",
        good: 94,
        bad: 17,
        con: "拼音彩绘书，有多小故事确实可做作文素材，个人感觉比较好，孩子现在还是喜欢看绘本"
      },
      {
        userName: "无昵称用户",
        time: "2017-08-24 22:04:08",
        good: 117,
        bad: 49,
        con: "书很满意，装帧典雅、大方，包装精美，是一本值得收藏的好书正版，印刷业很清晰，内容更不用说。是一本性价比很高的书。"
      },
      {
        userName: "匿名用户",
        time: "2017-11-14 17:24:17",
        good: 8,
        bad: 1,
        con: "书看着厚实，里面的故事都带着拼音，值得入手，每天给孩子读读故事，孩子学了拼音，就可以自己读，能看很长一段时间"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-30 15:17:50",
        good: 6,
        bad: 1,
        con: "买回来讲了一遍宝宝就记住了一些情节，看到乌云就说风是最厉害的，因为会把云吹走。。。好欣慰，后来拿到幼儿园，其他小朋友也喜欢。"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-19 13:07:17",
        good: 0,
        bad: 3,
        con: "一个代代相传的民间故事生动的传说故事，动听的民间童谣，久远的娶亲习俗和精致细腻的画面构成了本书强烈的民间和中国特色。在阅读中了解传统与文化体会寓意与幽默欣赏画面与细节。"
      }
      ]
    },
    //15.魅力江西

    {
      //书的信息
      BookInformation: {
        bookName: "魅力江西",
        author: "虞国庆",
        press: "中文天地出版股份有限公司",
        year: "2014-08",
        price: "32.00",
        Binding: "平装",
        folio: "16",
        ISBN: "9787210065838",
        imgUrl: "./img/1000032.jpg",
        authorIntro: "亲赴江西多次，记录真实的魅力江西。",
        //图书标签
        bookLabel: ['图书','历史','地方史志'],
        //主题词
        themaWords: ['江西省情概览'],
        //内容提要
        contentSummary: '《魅力江西 江西省情概览》分绿色家园、悠久历史、璀璨文化、红色摇篮、走向辉煌、追梦圆梦等六个篇章。纵贯往昔，横陈现状，全面展示了江西的悠久历史、灿烂文化、优美生态以及发展的巨大潜力和美好前景，旨在让广大青少年通过阅读《魅力江西 江西省情概览》，增强对家乡的认知度、自豪感、荣誉感和责任感，增添热爱家乡、建设家乡的热情。',
        //本书目录
        catalogues: ['第一章 绿色家园','第二章 悠久历史','第三章 璀璨文化','第四章 红色摇篮','第五章 走向辉煌','第六章 实现跨越','后记'],
      },
      //同类书籍
      similarBook: [
        {
          bookName: "摆渡人(精装插图纪念版)(精)",
          author: "[英]克莱儿·麦克福尔",
          press: "中文天地出版股份有限公司",
          year: "2016-09",
          ISBN: "9787550016903",
          imgUrl: "./img/1000004.jpg",
        },
        {
          bookName: "乒乒和乓乓钓大鱼(精)",
          author: "宫西达也 文/图，熊春，蒲蒲兰　译",
          press: "中文天地出版股份有限公司",
          year: "2007-10",
          ISBN: "9787539139340",
          imgUrl: "./img/1000012.jpg"
        },
        {
          bookName: "妈妈和女儿的悄悄话",
          author: "金毓菡",
          press: "中文天地出版股份有限公司",
          year: "2010-07",
          ISBN: "9787539037080",
          imgUrl: "./img/1000054.jpg"
        },
        {
          bookName: "三生三世十里桃花",
          author: "唐七",
          press: "中南出版传媒集团股份有限公司",
          year: "2015-06",
          ISBN: "9787540472252",
          imgUrl: "./img/1000008.jpg"
        },
        {
          bookName: "阿弥陀佛么么哒",
          author: "大冰",
          press: "中南出版传媒集团股份有限公司",
          year: "2015-08",
          ISBN: "9787540472238",
          imgUrl: "./img/1000002.jpg"
        },
  
      ],
      //购买推荐
      PurchaseRe: [{
          libraryName: "上海书城福州店",
          address: "上海市黄浦区福州路465号世纪出版大厦"
        },
        {
          libraryName: "崇文书城",
          address: "武汉市洪山区雄楚大道268号"
        },
        {
          libraryName: "新华书店长沙市分公司",
          address: "长沙市五一东路285号"
        },
        {
          libraryName: "新华书店武侯祠店",
          address: "成都市武侯区武侯祠大街266号华达商城1层"
        },
        {
          libraryName: "新华书店内蒙古店",
          address: " 内蒙古自治区呼和浩特市回民区中山西路49号(天元大酒店)"
        },
        {
          libraryName: "云南新华大厦",
          address: "昆明市人民东路6号"
        }
      ],
      //借阅推荐
      borrowRe: [{
          libraryName: "湖南图书馆",
          address: "湖南省长沙市芙蓉区韶山北路157号"
        },
        {
          libraryName: "江西省图书馆",
          address: "江西省南昌市洪都北大道160号"
        }
      ],
      comment: [{
          userName: "闽***x",
          time: "2018-03-15 14:36",
          good: 4,
          bad: 0,
          con: "物流挺快的，书籍还是挺不错的，一览江西风土人情，物超所值!"
        },
        {
          userName: "春***成",
        time: "2017-12-31 15:12",
        good: 0,
        bad: 0,
        con: "给喜欢的人买的，喜欢的人不喜欢我，也不喜欢送她的礼物……好难过"
        },
        {
          userName: "S***I",
        time: "2017-09-13 13:05",
        good: 0,
        bad: 0,
        con: "质量，纸张的质素就不怎么的了。"
        }      
      ]
    },

//16.2015年修订版马克思主义基本原理概论

    {
      //书的信息
      BookInformation: {
        bookName: "2015年修订版马克思主义基本原理概论",
        author: "《马克思主义基本原理概论》编写组",
        press: "高等教育出版社有限公司",
        year: "2015-08",
        price: "23.00",
        Binding: "平装",
        folio: "16开",
        ISBN: "9787040431971",
        imgUrl: "./img/1000030.jpg",
        authorIntro: "整理汇编旧版概论，重新编排。",
        //图书标签
        bookLabel: ['公共课','军事','政治','马克思主义理论'],
        //主题词
        themaWords: ['马克思主义理论'],
        //内容提要
        contentSummary: '"《马克思主义基本原理概论》（2015年修订版）是中宣部、教育部组织专家学者修订编写的“马克思主义理论研究和建设工程重点教材”。本书充分反映了去年以来我们党在理论和实践上的创新成果，特别是党的十七届四中全会精神和2009年中央经济工作会议精神，反映了新中国成立60年来经济建设、政治建设、文化建设、社会建设和党的建设取得的巨大成就和宝贵经验，反映了我国以民族平等，民族团结、民族区域自治和各民族共同繁荣为基本内容的民族政策和民族政策体系。为全国普通高等学校思想政治理论课统一使用教材。',
        //本书目录
        catalogues: ['第一章  世界的物质性及其发展规律','第二章  认识的本质及其发展规律','第三章  人类社会及其发展规律','第四章  资本主义的形成及其本质','第五章  资本主义发展的历史进程','第六章  社会主义社会及其发展','第七章  共产主义崇高理想及其最终实现','后记'],
      },
      //同类书籍
      similarBook: [
        {
          bookName: "摆渡人(精装插图纪念版)(精)",
          author: "[英]克莱儿·麦克福尔",
          press: "中文天地出版股份有限公司",
          year: "2016-09",
          ISBN: "9787550016903",
          imgUrl: "./img/1000004.jpg",
        },
        {
          bookName: "乒乒和乓乓钓大鱼(精)",
          author: "宫西达也 文/图，熊春，蒲蒲兰　译",
          press: "中文天地出版股份有限公司",
          year: "2007-10",
          ISBN: "9787539139340",
          imgUrl: "./img/1000012.jpg"
        },
        {
          bookName: "妈妈和女儿的悄悄话",
          author: "金毓菡",
          press: "中文天地出版股份有限公司",
          year: "2010-07",
          ISBN: "9787539037080",
          imgUrl: "./img/1000054.jpg"
        },
        {
          bookName: "三生三世十里桃花",
          author: "唐七",
          press: "中南出版传媒集团股份有限公司",
          year: "2015-06",
          ISBN: "9787540472252",
          imgUrl: "./img/1000008.jpg"
        },
        {
          bookName: "阿弥陀佛么么哒",
          author: "大冰",
          press: "中南出版传媒集团股份有限公司",
          year: "2015-08",
          ISBN: "9787540472238",
          imgUrl: "./img/1000002.jpg"
        },
  
      ],
      //购买推荐
      PurchaseRe: [{
          libraryName: "上海书城福州店",
          address: "上海市黄浦区福州路465号世纪出版大厦"
        },
        {
          libraryName: "崇文书城",
          address: "武汉市洪山区雄楚大道268号"
        },
        {
          libraryName: "新华书店长沙市分公司",
          address: "长沙市五一东路285号"
        },
        {
          libraryName: "新华书店武侯祠店",
          address: "成都市武侯区武侯祠大街266号华达商城1层"
        },
        {
          libraryName: "新华书店内蒙古店",
          address: " 内蒙古自治区呼和浩特市回民区中山西路49号(天元大酒店)"
        },
        {
          libraryName: "云南新华大厦",
          address: "昆明市人民东路6号"
        }
      ],
      //借阅推荐
      borrowRe: [{
          libraryName: "湖南图书馆",
          address: "湖南省长沙市芙蓉区韶山北路157号"
        },
        {
          libraryName: "江西省图书馆",
          address: "江西省南昌市洪都北大道160号"
        }
      ],
      comment: [{
          userName: "匿名用户",
          time: "2017-04-27 10:41:12",
          good: 0,
          bad: 0,
          con: "这本高教版的马克思主义基本原理概论，很权威的一本教材，值得一看。"
        },
        {
          userName: "清***0(匿名)",
          time: "2017-06-15 10:48:20",
          good: 0,
          bad: 0,
          con: "高校出版社的书，整个来说质量还是非常好的，也值得一读。"
        },
        {
          userName: "匿名用户",
          time: "2016-08-21 13:25:03",
          good: 0,
          bad: 0,
          con: "新版的，和13版在内容结构上有一些变化，不过内容变化几乎不变"
        },
        {
          userName: "无昵称用户",
          time: "2015-10-23 11:35:23",
          good: 0,
          bad: 0,
          con: "没想到一天就收到了！对于考研的我来说特别的及时！买过很多书 这个真的一看就是正版 纸质厚白清晰 书皮也硬真的很棒！以后买就在当当啦 真的是明智的选择 买教材正版。"
        },
        {
          userName: "anaelisa",
          time: "2016-06-26 14:59:13",
          good: 0,
          bad: 0,
          con: "虽然没有包装，但是是新书，没有折痕，没有缺页漏页，应该是正品。"
        },
        {
          userName: "野外老剑仙",
          time: "2016-05-19 09:26:34",
          good: 0,
          bad: 0,
          con: "书很好应该正版，可是感觉这个版本不如2010的好看美观了"
        }
      ]
    },
//17.商务英语视听说(高等学校英语拓展系列教程)

    {
      //书的信息
      BookInformation: {
        bookName: "商务英语视听说(高等学校英语拓展系列教程)",
        author: "李毅",
        press: "外语教学与研究出版社",
        year: "2013-05",
        price: "35.90",
        Binding: "平装",
        folio: "16开",
        ISBN: "9787560086644",
        imgUrl: "./img/1000038.jpg",
        authorIntro: "教授，硕士生导师。大连医科大学艺术学院院长。从事视觉艺术理论研究和摄影教育教学工作20余年，是国内摄影专业教育领域内影响较大的学科带头人、辽宁省特色专业负责人。",
        //图书标签
        bookLabel: ['职场英语','商务','生活实用英语','口语','外语'],
        //主题词
        themaWords: ['商务英语'],
        //内容提要
        contentSummary: '《商务英语视听说》涵盖商务英语交际的不同方面，从语言知识、交际技巧、商务实践三个层面，帮助学生掌握语言技能，了解商务知识，操练商务交际能力。《商务英语视听说》适合修完大学英语基础课程或完成一年级教学任务的大学本科学生，可作为后续ESP课程、选修课程或大学专业英语的导入课程开设。每单元包括：主题导入；听说练习；语言要点；视说练习；案例分析或调查报告。',
        //本书目录
        catalogues: ['Unit  1   Job Interviews','Unit 2   Jobs and Responsibilities','Unit  3   On the Phone','Unit  4   At a Meeting','Unit  5   Travel and Visits','Unit  6   Company Presentations','Unit 7   Product Presentations','Unit  8   Company Performance','Unit  9   Trade Fairs','Unit 10   Making Inquiries','Unit 11    Placing an Order','Unit 12   Terms of Payment','Unit 13   Delivery','Unit 14   Claims and Settlements','Unit 15   Marketing','Unit 16   Advertising','Glossary'],
      },
      //同类书籍
      similarBook: [
        {
          bookName: "摆渡人(精装插图纪念版)(精)",
          author: "[英]克莱儿·麦克福尔",
          press: "中文天地出版股份有限公司",
          year: "2016-09",
          ISBN: "9787550016903",
          imgUrl: "./img/1000004.jpg",
        },
        {
          bookName: "乒乒和乓乓钓大鱼(精)",
          author: "宫西达也 文/图，熊春，蒲蒲兰　译",
          press: "中文天地出版股份有限公司",
          year: "2007-10",
          ISBN: "9787539139340",
          imgUrl: "./img/1000012.jpg"
        },
        {
          bookName: "妈妈和女儿的悄悄话",
          author: "金毓菡",
          press: "中文天地出版股份有限公司",
          year: "2010-07",
          ISBN: "9787539037080",
          imgUrl: "./img/1000054.jpg"
        },
        {
          bookName: "三生三世十里桃花",
          author: "唐七",
          press: "中南出版传媒集团股份有限公司",
          year: "2015-06",
          ISBN: "9787540472252",
          imgUrl: "./img/1000008.jpg"
        },
        {
          bookName: "阿弥陀佛么么哒",
          author: "大冰",
          press: "中南出版传媒集团股份有限公司",
          year: "2015-08",
          ISBN: "9787540472238",
          imgUrl: "./img/1000002.jpg"
        },
  
      ],
      //购买推荐
      PurchaseRe: [{
          libraryName: "上海书城福州店",
          address: "上海市黄浦区福州路465号世纪出版大厦"
        },
        {
          libraryName: "崇文书城",
          address: "武汉市洪山区雄楚大道268号"
        },
        {
          libraryName: "新华书店长沙市分公司",
          address: "长沙市五一东路285号"
        },
        {
          libraryName: "新华书店武侯祠店",
          address: "成都市武侯区武侯祠大街266号华达商城1层"
        },
        {
          libraryName: "新华书店内蒙古店",
          address: " 内蒙古自治区呼和浩特市回民区中山西路49号(天元大酒店)"
        },
        {
          libraryName: "云南新华大厦",
          address: "昆明市人民东路6号"
        }
      ],
      //借阅推荐
      borrowRe: [{
          libraryName: "湖南图书馆",
          address: "湖南省长沙市芙蓉区韶山北路157号"
        },
        {
          libraryName: "江西省图书馆",
          address: "江西省南昌市洪都北大道160号"
        }
      ],
      comment: [{
          userName: "无昵称用户",
          time: "2016-02-19 13:32:20",
          good: 0,
          bad: 0,
          con: "编排非常好，老师上课选用材料很实用，既有词汇、情景句型，又有不同场景的视听材料，发音很正宗！"
        },
        {
          userName: "书之鲜",
          time: "2016-09-09 09:08:12",
          good: 0,
          bad: 0,
          con: "这次是帮同学买的。学校好像特别好感这套教材？"
        },
        {
          userName: "安之daybre...",
          time: "2014-05-25 22:20:54",
          good: 0,
          bad: 0,
          con: "买来后一翻开就知道买亏了。这本书名为本科生编写，其实和编者编写的高职高专教材大同小异。那套书我几年前就买来当参考书了。"
        },
        {
          userName: "购我所艾",
          time: "2014-12-17 07:48:05",
          good: 0,
          bad: 0,
          con: "内容实用 光碟靠谱 是学习商英的好书籍 值得推荐"
        },
        {
          userName: "yjmhslcg",
          time: "2013-09-06 13:42:49",
          good: 0,
          bad: 0,
          con: "有视频，如临其境，有听说，形式多样，这本书不错！配套教师用书怎么没有？"
        },
        {
          userName: "不忘本心",
          time: "2013-09-27 20:04:38",
          good: 0,
          bad: 0,
          con: "咱班里团购的，还算不错吧，老师让我们定的，内容挺实用的，光碟用起来感觉都是正版的，总体就好好的"
        }
      ]
    },

//18.读论语 学成语

    {
      //书的信息
      BookInformation: {
        bookName: "读论语 学成语",
        author: "韩兴娥,徐美华",
        press: "中文天地出版股份有限公司",
        year: "2015-06",
        price: "25.00",
        Binding: "平装",
        folio: "16开",
        ISBN: "9787210074199",
        imgUrl: "./img/1000043.jpg",
        authorIntro: "韩兴娥，山东省潍坊市北海学校语文高级教师。齐鲁名师。她用两个星期就带领三年级学生学完语文课本并取得较好的考试成绩，剩下的时间师生在课堂上共读课外书，被评为“全国2010年推动读书十大人物”。",
        //图书标签
        bookLabel: ['语文','小学一年级','中小学教辅'],
        //主题词
        themaWords: ['教辅'],
        //内容提要
        contentSummary: '如果说有一本内容精彩的书能打开你的省身之门，那么，非《读论语学成语》一书莫属。它没有华丽的辞藻，只有朴实的道理，却耐人寻味，字里行问充溢着至真至善。《读论语学成语》学成语有趣多了。一个个论语小故事，不仅能够轻松记住了成语，让读者明白了许多做人的道理。',
        //本书目录
        catalogues: ['一 学而篇1','二 为政篇21','三 八佾篇4','四 里仁篇55','五 公冶长篇75','...'],
      },
      //同类书籍
      similarBook: [
        {
          bookName: "摆渡人(精装插图纪念版)(精)",
          author: "[英]克莱儿·麦克福尔",
          press: "中文天地出版股份有限公司",
          year: "2016-09",
          ISBN: "9787550016903",
          imgUrl: "./img/1000004.jpg",
        },
        {
          bookName: "乒乒和乓乓钓大鱼(精)",
          author: "宫西达也 文/图，熊春，蒲蒲兰　译",
          press: "中文天地出版股份有限公司",
          year: "2007-10",
          ISBN: "9787539139340",
          imgUrl: "./img/1000012.jpg"
        },
        {
          bookName: "妈妈和女儿的悄悄话",
          author: "金毓菡",
          press: "中文天地出版股份有限公司",
          year: "2010-07",
          ISBN: "9787539037080",
          imgUrl: "./img/1000054.jpg"
        },
        {
          bookName: "三生三世十里桃花",
          author: "唐七",
          press: "中南出版传媒集团股份有限公司",
          year: "2015-06",
          ISBN: "9787540472252",
          imgUrl: "./img/1000008.jpg"
        },
        {
          bookName: "阿弥陀佛么么哒",
          author: "大冰",
          press: "中南出版传媒集团股份有限公司",
          year: "2015-08",
          ISBN: "9787540472238",
          imgUrl: "./img/1000002.jpg"
        },
  
      ],
      //购买推荐
      PurchaseRe: [{
          libraryName: "上海书城福州店",
          address: "上海市黄浦区福州路465号世纪出版大厦"
        },
        {
          libraryName: "崇文书城",
          address: "武汉市洪山区雄楚大道268号"
        },
        {
          libraryName: "新华书店长沙市分公司",
          address: "长沙市五一东路285号"
        },
        {
          libraryName: "新华书店武侯祠店",
          address: "成都市武侯区武侯祠大街266号华达商城1层"
        },
        {
          libraryName: "新华书店内蒙古店",
          address: " 内蒙古自治区呼和浩特市回民区中山西路49号(天元大酒店)"
        },
        {
          libraryName: "云南新华大厦",
          address: "昆明市人民东路6号"
        }
      ],
      //借阅推荐
      borrowRe: [{
          libraryName: "湖南图书馆",
          address: "湖南省长沙市芙蓉区韶山北路157号"
        },
        {
          libraryName: "江西省图书馆",
          address: "江西省南昌市洪都北大道160号"
        }
      ],
      comment: [{
          userName: "l***a",
          time: "2016-09-08 13:53",
          good: 0,
          bad: 0,
          con: "刚到，很好"
        }
      ]
    },

//19.笨狼的故事

    {
      //书的信息
      BookInformation: {
        bookName: "笨狼的故事",
        author: "汤素兰",
        press: "中南传媒",
        year: "2015-09",
        price: "26.00",
        Binding: "平装",
        folio: "32开",
        ISBN: "9787556204731",
        imgUrl: "./img/1000048.jpg",
        authorIntro: "汤素兰，女，汉族，1965年1月出生，湖南宁乡人，硕士研究生，文学硕士，1985年7月参加工作，2001年12月加入中国民主促进会。中国一级作家，教授，编审，中国作家协会会员，中国作家协会第九届全国委员会委员。",
        //图书标签
        bookLabel: ['图书','童书','中国儿童文学','童话故事','图书','童书','7-10岁','童话'],
        //主题词
        themaWords: ['中国版的小熊温尼'],
        //内容提要
        contentSummary: '一个大大的电视机，让小动物们都能当演员在里面表演节目；居然他还把自己的家都给给弄丢了。笨狼看上去笨笨的，却总是有许多新奇的想法，是个惹人怜爱的、非常善良的小家伙。',
        //本书目录
        catalogues: ['1. 笨狼是谁','2. 把家弄丢了','3. 晾尾巴','4. 半小时爸爸','5. 倒霉的一天','6. 当售票员','7. 上学'],
      },
      //同类书籍
      similarBook: [
        {
          bookName: "摆渡人(精装插图纪念版)(精)",
          author: "[英]克莱儿·麦克福尔",
          press: "中文天地出版股份有限公司",
          year: "2016-09",
          ISBN: "9787550016903",
          imgUrl: "./img/1000004.jpg",
        },
        {
          bookName: "乒乒和乓乓钓大鱼(精)",
          author: "宫西达也 文/图，熊春，蒲蒲兰　译",
          press: "中文天地出版股份有限公司",
          year: "2007-10",
          ISBN: "9787539139340",
          imgUrl: "./img/1000012.jpg"
        },
        {
          bookName: "妈妈和女儿的悄悄话",
          author: "金毓菡",
          press: "中文天地出版股份有限公司",
          year: "2010-07",
          ISBN: "9787539037080",
          imgUrl: "./img/1000054.jpg"
        },
        {
          bookName: "三生三世十里桃花",
          author: "唐七",
          press: "中南出版传媒集团股份有限公司",
          year: "2015-06",
          ISBN: "9787540472252",
          imgUrl: "./img/1000008.jpg"
        },
        {
          bookName: "阿弥陀佛么么哒",
          author: "大冰",
          press: "中南出版传媒集团股份有限公司",
          year: "2015-08",
          ISBN: "9787540472238",
          imgUrl: "./img/1000002.jpg"
        },
  
      ],
      //购买推荐
      PurchaseRe: [{
          libraryName: "上海书城福州店",
          address: "上海市黄浦区福州路465号世纪出版大厦"
        },
        {
          libraryName: "崇文书城",
          address: "武汉市洪山区雄楚大道268号"
        },
        {
          libraryName: "新华书店长沙市分公司",
          address: "长沙市五一东路285号"
        },
        {
          libraryName: "新华书店武侯祠店",
          address: "成都市武侯区武侯祠大街266号华达商城1层"
        },
        {
          libraryName: "新华书店内蒙古店",
          address: " 内蒙古自治区呼和浩特市回民区中山西路49号(天元大酒店)"
        },
        {
          libraryName: "云南新华大厦",
          address: "昆明市人民东路6号"
        }
      ],
      //借阅推荐
      borrowRe: [{
          libraryName: "湖南图书馆",
          address: "湖南省长沙市芙蓉区韶山北路157号"
        },
        {
          libraryName: "江西省图书馆",
          address: "江西省南昌市洪都北大道160号"
        }
      ],
      comment: [{
          userName: "无昵称用户",
          time: "2017-12-09 09:50:56",
          good: 0,
          bad: 0,
          con: "笨狼是孩子指名要买的系列，每晚看得不愿意睡觉，看到好笑的片段还要跑过来跟我说，每天都恳求我同意他带到学校，怕影响学习，同意每周四能带去，开心到不得了，好"
        },
        {
          userName: "匿名用户",
          time: "2017-06-14 09:25:36",
          good: 0,
          bad: 0,
          con: "学校推荐看的书，反正孩子也喜欢看，一直偏向国外文学，国内的都是学校推荐居多。在孩子的世界里什么都可以是可爱，包括狼。这大概就是孩子善良的世界"
        },
        {
          userName: "语***8",
          time: "2017-04-12 08:46:29",
          good: 0,
          bad: 0,
          con: "故事情节是符合一二年级小学生的理解水平，孩子看得很开心"
        },
        {
          userName: "z***3",
          time: "2017-07-29 11:29:52",
          good: 0,
          bad: 0,
          con: "很好，孩子非常喜欢看！"
        },
        {
          userName: "无昵称用户",
          time: "2018-02-08 22:51:27",
          good: 0,
          bad: 0,
          con: "帮别人买的，听说很不错啊。 "
        },
        {
          userName: "王明鹤",
          time: "2017-10-29 22:08:28",
          good: 0,
          bad: 0,
          con: "送货快，孩子喜欢，必读！"
        }
      ]
    },

//20. Word/Excel/PowerPoint2010三合一办公应用

    {
      //书的信息
      BookInformation: {
        bookName: "Word/Excel/PowerPoint2010三合一办公应用",
        author: "神龙工作室 等",
        press: "人民邮电出版社",
        year: "2014-04",
        price: "49.80",
        Binding: "平装",
        folio: "16开",
        ISBN: "9787115344298",
        imgUrl: "./img/1000050.jpg",
        authorIntro: "收集整理多种办公软件教程，整理成可用图书.",
        //图书标签
        bookLabel: ['微软Office','家庭与办公室用书','计算机/网络'],
        //主题词
        themaWords: ['历经时间检验的经典童话作品'],
        //内容提要
        contentSummary: '《Word/Excel/PowerPoint 2010三合一办公应用》附带一张专业级的DVD格式的多媒体教学光盘，提供长达10个小时的与本书内容同步的多媒体教学内容。通过全程视频讲解，对书中知识点进行深入讲解，一步一步地引导读者掌握使用Word、Excel和PowerPoint进行日常办公的各种操作与应用。此外光盘中还附有书中所有实例对应的原始文件、素材文件以及*终效果文件.',
        //本书目录
        catalogues: ['第1篇　Word办公应用','第2章　图形、图表与简单排版','第3篇　PowerPoint办公应用','第4章　数据透视表与数据透视图','第5章　排序、筛选与分类汇总','第6章　美化与打印工作表','第7章　保护与共享工作簿'],
      },
      //同类书籍
      similarBook: [
        {
          bookName: "摆渡人(精装插图纪念版)(精)",
          author: "[英]克莱儿·麦克福尔",
          press: "中文天地出版股份有限公司",
          year: "2016-09",
          ISBN: "9787550016903",
          imgUrl: "./img/1000004.jpg",
        },
        {
          bookName: "乒乒和乓乓钓大鱼(精)",
          author: "宫西达也 文/图，熊春，蒲蒲兰　译",
          press: "中文天地出版股份有限公司",
          year: "2007-10",
          ISBN: "9787539139340",
          imgUrl: "./img/1000012.jpg"
        },
        {
          bookName: "妈妈和女儿的悄悄话",
          author: "金毓菡",
          press: "中文天地出版股份有限公司",
          year: "2010-07",
          ISBN: "9787539037080",
          imgUrl: "./img/1000054.jpg"
        },
        {
          bookName: "三生三世十里桃花",
          author: "唐七",
          press: "中南出版传媒集团股份有限公司",
          year: "2015-06",
          ISBN: "9787540472252",
          imgUrl: "./img/1000008.jpg"
        },
        {
          bookName: "阿弥陀佛么么哒",
          author: "大冰",
          press: "中南出版传媒集团股份有限公司",
          year: "2015-08",
          ISBN: "9787540472238",
          imgUrl: "./img/1000002.jpg"
        },
  
      ],
      //购买推荐
      PurchaseRe: [{
          libraryName: "上海书城福州店",
          address: "上海市黄浦区福州路465号世纪出版大厦"
        },
        {
          libraryName: "崇文书城",
          address: "武汉市洪山区雄楚大道268号"
        },
        {
          libraryName: "新华书店长沙市分公司",
          address: "长沙市五一东路285号"
        },
        {
          libraryName: "新华书店武侯祠店",
          address: "成都市武侯区武侯祠大街266号华达商城1层"
        },
        {
          libraryName: "新华书店内蒙古店",
          address: " 内蒙古自治区呼和浩特市回民区中山西路49号(天元大酒店)"
        },
        {
          libraryName: "云南新华大厦",
          address: "昆明市人民东路6号"
        }
      ],
      //借阅推荐
      borrowRe: [{
          libraryName: "湖南图书馆",
          address: "湖南省长沙市芙蓉区韶山北路157号"
        },
        {
          libraryName: "江西省图书馆",
          address: "江西省南昌市洪都北大道160号"
        }
      ],
      comment: [{
          userName: "无昵称用户",
          time: "2017-12-09 09:50:56",
          good: 0,
          bad: 0,
          con: "笨狼是孩子指名要买的系列，每晚看得不愿意睡觉，看到好笑的片段还要跑过来跟我说，每天都恳求我同意他带到学校，怕影响学习，同意每周四能带去，开心到不得了，好"
        },
        {
          userName: "匿名用户",
          time: "2017-06-14 09:25:36",
          good: 0,
          bad: 0,
          con: "学校推荐看的书，反正孩子也喜欢看，一直偏向国外文学，国内的都是学校推荐居多。在孩子的世界里什么都可以是可爱，包括狼。这大概就是孩子善良的世界。"
        },
        {
          userName: "语***8",
          time: "2017-04-12 08:46:29",
          good: 0,
          bad: 0,
          con: "故事情节是符合一二年级小学生的理解水平，孩子看得很开心"
        },
        {
          userName: "无昵称用户",
          time: "2015-09-02 12:58:39",
          good: 0,
          bad: 0,
          con: "送货快，孩子喜欢，必读！"
        },
        {
          userName: "王明鹤",
          time: "2017-10-29 22:08:28",
          good: 0,
          bad: 0,
          con: " 哈哈，这套儿子特别喜欢，相当经典！"
        },
        {
          userName: "无昵称用户",
          time: "2017-09-05 15:47:35",
          good: 0,
          bad: 0,
          con: "产品质量较好、送货速度快、服务态度较好，总体评价为优"
        }
      ]
    },
//21.英语1(基础模块)

    {
      //书的信息
      BookInformation: {
        bookName: "英语1(基础模块)",
        author: "中等职业学校英语教材编写组",
        press: "高等教育出版社有限公司",
        year: "2011-05",
        price: "18.60",
        Binding: "平装",
        folio: "16开",
        ISBN: "9787040269871",
        imgUrl: "./img/1000057.jpg",
        authorIntro: "中等职业学校英语教材编写组,汇集多位资深职教经验丰富的在职教师团队。",
        //图书标签
        bookLabel: ['中职教育','征订教材','教材'],
        //主题词
        themaWords: ['英语基础'],
        //内容提要
        contentSummary: '《英语1（基础模块）》安排了不同形式的任务，例如制作海报、计划生日聚会、找工作伙伴、组建兴趣小组，等等。在完成任务的过程中，你们会发现学习英语不再是枯燥地记忆单词和语法，而是在仿真的生活或工作场景中运用英语去听、去说、去做。相信同学们通过认真学习，一定能用所学英语制作出自己的名片或班级活动海报等，并体验到英语学习的成就感。',
        //本书目录
        catalogues: ['Unit  1   Interviews','Unit 2   Responsibilities','Unit  3   The Phone','Unit  4   Meeting','Unit  5   Travel and Visits'],
      },
      //同类书籍
      similarBook: [
        {
          bookName: "摆渡人(精装插图纪念版)(精)",
          author: "[英]克莱儿·麦克福尔",
          press: "中文天地出版股份有限公司",
          year: "2016-09",
          ISBN: "9787550016903",
          imgUrl: "./img/1000004.jpg",
        },
        {
          bookName: "乒乒和乓乓钓大鱼(精)",
          author: "宫西达也 文/图，熊春，蒲蒲兰　译",
          press: "中文天地出版股份有限公司",
          year: "2007-10",
          ISBN: "9787539139340",
          imgUrl: "./img/1000012.jpg"
        },
        {
          bookName: "妈妈和女儿的悄悄话",
          author: "金毓菡",
          press: "中文天地出版股份有限公司",
          year: "2010-07",
          ISBN: "9787539037080",
          imgUrl: "./img/1000054.jpg"
        },
        {
          bookName: "三生三世十里桃花",
          author: "唐七",
          press: "中南出版传媒集团股份有限公司",
          year: "2015-06",
          ISBN: "9787540472252",
          imgUrl: "./img/1000008.jpg"
        },
        {
          bookName: "阿弥陀佛么么哒",
          author: "大冰",
          press: "中南出版传媒集团股份有限公司",
          year: "2015-08",
          ISBN: "9787540472238",
          imgUrl: "./img/1000002.jpg"
        },
  
      ],
      //购买推荐
      PurchaseRe: [{
          libraryName: "上海书城福州店",
          address: "上海市黄浦区福州路465号世纪出版大厦"
        },
        {
          libraryName: "崇文书城",
          address: "武汉市洪山区雄楚大道268号"
        },
        {
          libraryName: "新华书店长沙市分公司",
          address: "长沙市五一东路285号"
        },
        {
          libraryName: "新华书店武侯祠店",
          address: "成都市武侯区武侯祠大街266号华达商城1层"
        },
        {
          libraryName: "新华书店内蒙古店",
          address: " 内蒙古自治区呼和浩特市回民区中山西路49号(天元大酒店)"
        },
        {
          libraryName: "云南新华大厦",
          address: "昆明市人民东路6号"
        }
      ],
      //借阅推荐
      borrowRe: [{
          libraryName: "湖南图书馆",
          address: "湖南省长沙市芙蓉区韶山北路157号"
        },
        {
          libraryName: "江西省图书馆",
          address: "江西省南昌市洪都北大道160号"
        }
      ],
      comment: [{
          userName: "匿名用户",
          time: "2017-08-03 17:23:43",
          good: 0,
          bad: 0,
          con: "语音清晰，和配套的教材使用很不错，主要是让孩子适应一下语音环境。"
        },
        {
          userName: "匿名用户",
          time: "2018-02-11 20:24:31",
          good: 0,
          bad: 0,
          con: "正版书籍，值得推荐，到货快，非常满意！"
        },
        {
          userName: "无昵称用户",
          time: "2018-02-11 10:41:55",
          good: 0,
          bad: 0,
          con: "此套书真是价格便宜又实用，很适合学英文，前言还教授了如何学英语。就是不知道mp3音频在哪儿可以找到"
        },
        {
          userName: "无昵称用户",
          time: "2017-12-24 11:53:26",
          good: 0,
          bad: 0,
          con: "这么多也没箱子，快递员是白字先生，这十本书是一个非常薄的塑封，从袋子里拿出来就烂了！好在书没什么事儿，就一张简易CD，比没CD贵那么多！"
        }
      ]
    }
  ]
  //同类书籍
  var renderSimilarBook = function(index) {
    var smailarLen = data[index].similarBook.length;
    var html = "";
    var imgUrl;

    for (let i = 0; i < smailarLen; i++) {
      imgUrl = data[index].similarBook[i].imgUrl;
      imgUrl = imgUrl === './fourImg/20000.jpg' ? './fourImg/404.svg' : imgUrl;

      html +=
        "<li>" +
        '<img class="fl" src="' +
        imgUrl +
        '" alt="">' +
        '<dl class="fl">' +
        "<dt>" +
        data[index].similarBook[i].bookName +
        "</dt>" +
        "<dd>" +
     
        "<p>级别: " +
        data[index].similarBook[i].press +
        "</p>" +
		"<p>评分: " +
		data[index].similarBook[i].author +
		"</p>" +
        "<p>类别: " +
        data[index].similarBook[i].year +
        "</p>" +
        "<p>官方电话: " +
        data[index].similarBook[i].ISBN +
        "</p>" +
        "</dd>" +
        "</dl>" +
        "</li>";
    }
    $(".aside-left ul").html(html);
  };

  // 书的信息
  var renderBookInfo = function(index) {
    var html =
      '<img class="fl" src="' +
      data[index].BookInformation.imgUrl +
      '" alt="">' +
      '<dl class="fl">' +
      "<dt>" +
      data[index].BookInformation.bookName +
      "</dt>" +
      "<dd>" +
      "<p>级别: " +
      data[index].BookInformation.press +
      "</p>" +
      "<p>评分: " +
      data[index].BookInformation.author +
      "</p>" +
      "<p>类别: " +
      data[index].BookInformation.year +
      "</p>" +
      "<p>地址: " +
      data[index].BookInformation.price +
      "</p>" +
      "<p>公告: " +
      data[index].BookInformation.Binding +
      "</p>" +
      "<p>官方电话: " +
      data[index].BookInformation.ISBN +
      "</p>" +
      "</dd>" +
      "</dl>";

    $(".middle_con .middle_top .con_left").html(html);
  };

  //图书标签
  var renderBookLabel = function(index) {
    var html = "";

    var bookLabelLen = data[index].BookInformation.bookLabel.length;

    for (let i = 0; i < bookLabelLen; i++) {
      html += " <li>" + data[index].BookInformation.bookLabel[i] + "</li>";
    }

    $(".middle_con .middle_top .con_right .bookLabel").html(html);
  };

  //主题推荐
  var renderBookSubject = function(index) {
    var themLen = data[index].BookInformation.themaWords.length;
    var html = "";

    for (let i = 0; i < themLen; i++) {
      html += "<li>" + data[index].BookInformation.themaWords[i] + "</li>";
    }

    $(".middle_con .middle_top .con_right .themaWords").html(html);
  };

  // 内容提要
  var renderContentSummary = function(index) {
    $(".middle_con .middle_top .con_link .link_con").text(
      data[index].BookInformation.contentSummary
    );
  };

  //本书目录、作者
  var renderBookCatalog = function(index) {
    var len, html;
    len = data[index].BookInformation.catalogues.length;
    html = "";

    for (let i = 0; i < len; i++) {
      html +=  data[index].BookInformation.catalogues[i];
    }
    $(".middle_con .middle_top .con_link .link_ul").text(html);
    /* 本书作者 */
    $(".middle_con .middle_top .con_link .link_author").html(
      data[index].BookInformation.authorIntro
    );
  };

  // 购买推荐
  var renderRecommend = function(index) {
    var len, html;
    len = data[index].PurchaseRe.length;
    html = "";

    for (let i = 0; i < len; i++) {
      html +=
        '<dl class="clearfix">' +
        "<dt >" +
        '<span class="number">' +
        (i + 1) +
        ":" +
        "</span>" +
        '<span class="title">' +
        data[index].PurchaseRe[i].libraryName +
        "</span>" +
        "</dt>" +
        "<dd>地址: " +
        data[index].PurchaseRe[i].address +
        "</dd>" +
        "</dl>";
    }
    $(".middle_button .button_left .button_con .purchase").html(html);
  };

  //借阅推荐
  var renderBorrowRecommend = function(index) {
    var len, html;
    len = data[index].borrowRe.length;
    html = "";

    for (let i = 0; i < len; i++) {
      html +=
        '<dl class="clearfix">' +
        "<dt >" +
        '<span class="number">' +
        (i + 1) +
        ":" +
        "</span>" +
        '<span class="title">' +
        data[index].borrowRe[i].libraryName +
        "</span>" +
        "</dt>" +
        "<dd>地址: " +
        data[index].borrowRe[i].address +
        "</dd>" +
        "</dl>";
    }
    $(".middle_button .button_right .button_con .jieyue").html(html);
  };

  // 图书评论
  var renderBookComment = function(index) {
    var len, html;
    len = data[index].comment.length;
    html = "";

    for (let i = 0; i < len; i++) {
      html +=
        '<dl class="clearfix">' +
        '<dt class="clearfix">' +
        '<div class="fl user">' +
        "<p>" +
        data[index].comment[i].userName +
        "</p>" +
        '<p class="time">' +
        data[index].comment[i].time +
        "</p>" +
        "</div>" +
        '<div class="fr comment">' +
        '<span class="comment_one iconfont icon-pinglun">' +
        data[index].comment[i].bad +
        "</span>" +
        '<span class="iconfont icon-xin">' +
        data[index].comment[i].good +
        "</span>" +
        "</div>" +
        "</dt>" +
        '<dd class="clearfix">' +
        data[index].comment[i].con +
        "</dd>" +
        "</dl>";
    }
    $(".aside-right .aside_con").html(html);
  };

  /* 渲染页面 */
  var renderBookDetail = function(index) {
    renderSimilarBook(index);
    renderBookInfo(index);
    renderBookLabel(index);
    renderBookSubject(index);
    renderContentSummary(index);
    renderBookCatalog(index);
    renderRecommend(index);
    renderBorrowRecommend(index);
    renderBookComment(index);
  };
  renderBookDetail(index);

  var showSimilarBookInfo = function() {
    var similarBook = $(".aside-left>ul");

    similarBook.on("click", 'li', function(el) {
      var curItem = $(el.currentTarget);
      var bookName = curItem.find('dt').text().trim();
      var hasBook = false;
      var index = 0;

      for(var i = 0; i < data.length; i++) {
        if (data[i]["BookInformation"]["bookName"] === bookName) {
          index = i;
          hasBook = true;
          break;
        }
      }

      if (hasBook) renderBookDetail(index);

    });
  };

  showSimilarBookInfo();

  // 畅销书排行榜获取高度
  var rankH = $(".con li:nth-child(2) .book-rank").height();
  var rankShowH = 3.5 * rankH;
  var overHiddenH = rankH * 5 + rankShowH;
  $(".book-show").css("height", rankShowH + "px");
  var curBookRank = $(".aside-left li.active .book-rank");
  curBookRank.css("height", rankH + "px");

  //   获取行高
  var topSpan = $(".aside-left .top .book-rank span");
  var topSpanH = topSpan.height();
  topSpan.css("line-height", topSpanH + "px");

  var bottomSpan = $(".aside-left .bottom .book-rank span");
  var bottomSpanH = bottomSpan.height();
  bottomSpan.css("line-height", bottomSpanH + "px");

  //   获取各地区销售码洋排行高度
  var areaRankBox = $(".aside-right .area-rank .con");
  var areaRankH = areaRankBox.height();
  var areaRankLiH = Math.round(areaRankH / 3);
  areaRankBox.find("li").css("height", areaRankLiH + "px");
  var areaUl = areaRankBox.children("ul");

  var areaUlH = areaUl.height();
  // 定时动画效果
  // 销售码洋排行
  var num = 0;
  setInterval(function() {
    num++;
    num > 4 ? (num = 0) : num;
    areaUl.css("top", -(num * areaRankH) + "px");
  }, 2000);
  //   同类图书
  function fanzhuan(parent, children, num, time, state) {
    clearInterval(parent.timer);

    var pressNum = -1;

    var rankbUl = $(parent);
    var rankbLen = rankbUl.children().length;
    parent.timer = setInterval(function() {
      pressNum++;

      if (pressNum >= num) {
        if (!state) {
          $(children).hide();
        }
      }
      if (pressNum > rankbLen) {
        pressNum = -1;
        if (!state) {
          $(children).show();
        }
      }
      // console.log(pressNum)
      var curLi = rankbUl.children().eq(pressNum);
      // console.log(curLi);
      if (state) {
        curLi.addClass("pressRotate");
        curLi.siblings().removeClass("pressRotate");
      }
    }, time);
  }
  fanzhuan(".aside-left  ul", ".aside-left  li:lt(5)", 5, 1500, true);
  fanzhuan(
    ".aside-right .con_top .aside_con",
    ".aside-right .con_top .aside_con dl:lt(3)",
    2,
    1000
  );
  // fanzhuan('.aside-right .con_button .aside_con', '.aside-right .con_button .aside_con dl:lt(3)', 2,800)

  // 推荐
  function translate($dom, $childrenFirst) {
    var $uList = $($dom);
    var timer = null;
    //触摸清空定时器
    $uList
      .hover(
        function() {
          clearInterval(timer);
        },
        function() {
          //离开启动定时器
          timer = setInterval(function() {
            scrollList($uList);
          }, 1000);
        }
      )
      .trigger("mouseleave"); //自动触发触摸事件

    //滚动动画
    function scrollList(obj) {
      //获得当前<li>的高度
      var scrollHeight = $($childrenFirst).height();
      //滚动出一个<li>的高度
      $uList.stop().animate(
        {
          marginTop: -scrollHeight
        },
        600,
        function() {
          //动画结束后，将当前<ul>marginTop置为初始值0状态，再将第一个<li>拼接到末尾。
          $uList
            .css({
              marginTop: 0
            })
            .find("dl:first")
            .appendTo($uList);
        }
      );
    }
  }

  translate(
    ".button_left .button_con .container",
    ".button_left .button_con .container dl:first"
  );
  translate(
    ".button_right .button_con .container",
    ".button_right .button_con .container dl:first"
  );
  //   畅销书排行
  var ranktUl = $(".aside-left .top ul");
  var bookLiLen = ranktUl.children().length;

  var bookNum = 0;

  var timer01 = setInterval(function() {
    bookNum++;
    // debugger
    if (bookNum % 5 == 0) {
      $(".aside-left .top li:lt(" + bookNum + ")").hide();
    }

    if (bookNum == bookLiLen) {
      bookNum = 0;
      ranktUl.children().show();
    }

    ranktUl.children().removeClass("active");
    ranktUl
      .children()
      .eq(bookNum)
      .addClass("active");

    ranktUl.find(".book-show").hide();
    ranktUl
      .children()
      .eq(bookNum)
      .children(".book-show")
      .show();
  }, 2000);
});

// // //   // 饼图
// // var pie1 = echarts.init(document.getElementById("pie1"), "macarons");
// // var pie2 = echarts.init(document.getElementById("pie2"), "macarons");

// // var rich = {
// //   big: {
// //     fontSize: 24,
// //     lineHeight: 40,
// //     fontFamily: "Rubik"
// //   },
// //   small: {
// //     fontSize: 16
// //   }
// // };
// var pieOption1 = {
//   series: [
//     {
//       name: "销售占比",
//       type: "pie",
//       radius: ["50%", "70%"],
//       hoverOffset: 5,
//       center: ["50%", "40%"],
//       avoidLabelOverlap: false,
//       color: ["#0239a7", "#fff", "#24feb4", "#23539b", "#3c9de4"],
//       label: {
//         normal: {
//           show: false,
//           position: "center"
//         },
//         emphasis: {
//           show: true,
//           color: "#fff",
//           formatter: function(params, ticket, callback) {
//             return (
//               "{big|" + params.value + "}{small|%}\n{small|" + params.name + "}"
//             );
//           },
//           // '{a|这段文本采用样式a}'
//           rich: rich
//         }
//       },
//       labelLine: {
//         normal: {
//           show: false
//         }
//       },
//       data: [
//         {
//           value: 18.6,
//           name: "社科",
//           label: {
//             normal: {
//               formatter: "{c}%\n\n{b}"
//             }
//           }
//         },
//         {
//           value: 13.8,
//           name: "教育",
//           label: {
//             normal: {
//               formatter: "{c}%\n\n{b}"
//             }
//           }
//         },
//         {
//           value: 9.1,
//           name: "文艺",
//           label: {
//             normal: {
//               formatter: "{c}%\n\n{b}"
//             }
//           }
//         },
//         {
//           value: 6.4,
//           name: "少儿",
//           label: {
//             normal: {
//               formatter: "{c}%\n\n{b}"
//             }
//           }
//         },
//         {
//           value: 52.1,
//           name: "其他",
//           label: {
//             normal: {
//               formatter: "{c}%\n\n{b}"
//             }
//           }
//         }
//       ]
//     }
//   ]
// };
// var pieOption2 = {
//   series: [
//     {
//       name: "库存占比",
//       type: "pie",
//       radius: ["50%", "70%"],
//       hoverOffset: 10,
//       avoidLabelOverlap: false,
//       color: ["#23539b", "#24feb4", "#fff", "#0239a7", "#3c9de4"],
//       center: ["50%", "40%"],
//       label: {
//         normal: {
//           show: false,
//           position: "center"
//         },
//         emphasis: {
//           show: true,
//           color: "#fff",
//           formatter: function(params, ticket, callback) {
//             return (
//               "{big|" + params.value + "}{small|%}\n{small|" + params.name + "}"
//             );
//           },
//           // '{a|这段文本采用样式a}'
//           rich: rich
//         }
//       },
//       labelLine: {
//         normal: {
//           show: false
//         }
//       },
//       data: [
//         {
//           value: 20.5,
//           name: "少儿",
//           label: {
//             normal: {
//               formatter: "{c}%\n\n{b}"
//             }
//           }
//         },
//         {
//           value: 15.7,
//           name: "文艺",
//           label: {
//             normal: {
//               formatter: "{c}%\n\n{b}"
//             }
//           }
//         },
//         {
//           value: 9.6,
//           name: "教育",
//           label: {
//             normal: {
//               formatter: "{c}%\n\n{b}"
//             }
//           }
//         },
//         {
//           value: 7.3,
//           name: "社科",
//           label: {
//             normal: {
//               formatter: "{c}%\n\n{b}"
//             }
//           }
//         },
//         {
//           value: 46.9,
//           name: "其他",
//           label: {
//             normal: {
//               formatter: "{c}%\n\n{b}"
//             }
//           }
//         }
//       ]
//     }
//   ]
// };
// pie1.currentIndex = -1;
// pie1.setOption(pieOption1);

// setInterval(function() {
//   var dataLen = pieOption1.series[0].data.length;
//   // 取消之前高亮的图形
//   pie1.dispatchAction({
//     type: "downplay",
//     seriesIndex: 0,
//     dataIndex: pie1.currentIndex
//   });
//   pie1.currentIndex = (pie1.currentIndex + 1) % dataLen;
//   // 高亮当前图形
//   pie1.dispatchAction({
//     type: "highlight",
//     seriesIndex: 0,
//     dataIndex: pie1.currentIndex
//   });
// }, 1000);

// pie2.currentIndex = -1;

// pie2.setOption(pieOption2);
// setInterval(function() {
//   var dataLen = pieOption2.series[0].data.length;
//   // 取消之前高亮的图形
//   pie2.dispatchAction({
//     type: "downplay",
//     seriesIndex: 0,
//     dataIndex: pie2.currentIndex
//   });
//   pie2.currentIndex = (pie2.currentIndex + 1) % dataLen;
//   // 高亮当前图形
//   pie2.dispatchAction({
//     type: "highlight",
//     seriesIndex: 0,
//     dataIndex: pie2.currentIndex
//   });
// }, 1000);
// //   // 柱形折线图

// var trendBar1 = echarts.init(document.getElementById("trendBar1"));

// var optionBar = {
//   grid: {
//     top: 50,
//     bottom: "20%"
//   },
//   legend: {
//     data: ["销售码洋", "同比增长"],
//     right: "5%",
//     itemWidth: 18,
//     itemHeight: 12,
//     textStyle: {
//       color: "#fff"
//     }
//   },
//   xAxis: {
//     data: [
//       "1月",
//       "2月",
//       "3月",
//       "4月",
//       "5月",
//       "6月",
//       "7月",
//       "8月",
//       "9月",
//       "10月",
//       "11月",
//       "12月"
//     ],
//     axisLine: {
//       show: false,
//       lineStyle: {
//         color: "#07bffb"
//       }
//     },
//     axisTick: {
//       show: false
//     },
//     axisLabel: {
//       interval: 0
//     }
//   },
//   yAxis: [
//     {
//       name: "码洋(/千万)",
//       axisLine: {
//         show: false,
//         lineStyle: {
//           color: "#07bffb"
//         }
//       },
//       splitLine: {
//         show: false
//       },
//       axisTick: {
//         show: false
//       },
//       interval: 5,
//       min: 0,
//       max: 20,
//       position: "left"
//     },
//     {
//       name: "同比增长(%)",
//       max: 100,
//       min: 0,
//       axisLabel: {
//         formatter: "{value}"
//       },
//       axisLine: {
//         show: false,
//         lineStyle: {
//           color: "#07bffb"
//         }
//       },
//       splitLine: {
//         show: false
//       },
//       axisTick: {
//         show: false
//       },
//       position: "right"
//     }
//   ],
//   series: [
//     {
//       name: "销售码洋",
//       type: "bar",
//       barWidth: "40%",
//       barGap: 5,
//       itemStyle: {
//         normal: {
//           color: new echarts.graphic.LinearGradient(
//             0,
//             0,
//             0,
//             1,
//             [
//               {
//                 offset: 0,
//                 color: "#00fecc"
//               },
//               {
//                 offset: 0.8,
//                 color: "#2690cf"
//               }
//             ],
//             false
//           )
//         }
//       },
//       data: [2.5, 5.4, 6.4, 4.4, 5.7, 11, 12, 10, 8, 14, 18, 19]
//     },
//     {
//       name: "同比增长",
//       type: "line",
//       itemStyle: {
//         color: "#fff"
//       },
//       yAxisIndex: 1,
//       data: [10, 8, 36, 12, 24, 16, 48, 32, 18, 14, 66, 70]
//     }
//   ]
// };
// trendBar1.setOption(optionBar);
